OurDreams/mx207/mxapp/bsp/board/mx207/stm32f2xxeth.c
/**
 ******************************************************************************
 * @file    stm32f2x7_eth.c
 * @author  MCD Application Team
 * @version V1.0.0
 * @date    25-April-2011
 * @brief   This file is the low level driver for STM32F2x7 Ethernet Controller.
 *          This driver does not include low level functions for PTP time-stamp.
 ******************************************************************************
 * @attention
 *
 * THE PRESENT FIRMWARE WHICH IS FOR GUIDANCE ONLY AIMS AT PROVIDING CUSTOMERS
 * WITH CODING INFORMATION REGARDING THEIR PRODUCTS IN ORDER FOR THEM TO SAVE
 * TIME. AS A RESULT, STMICROELECTRONICS SHALL NOT BE HELD LIABLE FOR ANY
 * DIRECT, INDIRECT OR CONSEQUENTIAL DAMAGES WITH RESPECT TO ANY CLAIMS ARISING
 * FROM THE CONTENT OF SUCH FIRMWARE AND/OR THE USE MADE BY CUSTOMERS OF THE
 * CODING INFORMATION CONTAINED HEREIN IN CONNECTION WITH THEIR PRODUCTS.
 *
 * <h2><center>&copy; COPYRIGHT 2011 STMicroelectronics</center></h2>
 ******************************************************************************
 */

/* Includes ------------------------------------------------------------------*/
#include "stm32f2xxeth.h"
#include <stm32f2xx.h>
#include <string.h>
#include <shell.h>
#include <logLib.h>
#include <taskLib.h>

/** @addtogroup STM32F2x7_ETH_Driver
 * @brief ETH driver modules
 * @{
 */

/** @defgroup ETH_Private_TypesDefinitions
 * @{
 */
/**
 * @}
 */

/** @defgroup ETH_Private_Defines
 * @{
 */

/**
 * @}
 */

/** @defgroup ETH_Private_Macros
 * @{
 */
/**
 * @}
 */

/** @defgroup ETH_Private_Variables
 * @{
 */

#if defined   (__CC_ARM) /*!< ARM Compiler */
__align(4)
ETH_DMADESCTypeDef DMARxDscrTab[ETH_RXBUFNB];/* Ethernet Rx MA Descriptor */
__align(4)
ETH_DMADESCTypeDef DMATxDscrTab[ETH_TXBUFNB];/* Ethernet Tx DMA Descriptor */
__align(4)
uint8_t Rx_Buff[ETH_RXBUFNB][ETH_RX_BUF_SIZE]; /* Ethernet Receive Buffer */
__align(4)
uint8_t Tx_Buff[ETH_TXBUFNB][ETH_TX_BUF_SIZE]; /* Ethernet Transmit Buffer */

#elif defined ( __ICCARM__ ) /*!< IAR Compiler */
#pragma data_alignment=4
ETH_DMADESCTypeDef DMARxDscrTab[ETH_RXBUFNB];/* Ethernet Rx MA Descriptor */
#pragma data_alignment=4
ETH_DMADESCTypeDef DMATxDscrTab[ETH_TXBUFNB];/* Ethernet Tx DMA Descriptor */
#pragma data_alignment=4
uint8_t Rx_Buff[ETH_RXBUFNB][ETH_RX_BUF_SIZE]; /* Ethernet Receive Buffer */
#pragma data_alignment=4
uint8_t Tx_Buff[ETH_TXBUFNB][ETH_TX_BUF_SIZE]; /* Ethernet Transmit Buffer */

#elif defined (__GNUC__) /*!< GNU Compiler */
ETH_DMADESCTypeDef DMARxDscrTab[ETH_RXBUFNB] __attribute__ ((aligned (4))); /* Ethernet Rx DMA Descriptor */
ETH_DMADESCTypeDef DMATxDscrTab[ETH_TXBUFNB] __attribute__ ((aligned (4))); /* Ethernet Tx DMA Descriptor */
uint8_t Rx_Buff[ETH_RXBUFNB][ETH_RX_BUF_SIZE] __attribute__ ((aligned (4))); /* Ethernet Receive Buffer */
uint8_t Tx_Buff[ETH_TXBUFNB][ETH_TX_BUF_SIZE] __attribute__ ((aligned (4))); /* Ethernet Transmit Buffer */
#elif defined  (__TASKING__) /*!< TASKING Compiler */                           
__align(4)
    ETH_DMADESCTypeDef DMARxDscrTab[ETH_RXBUFNB];/* Ethernet Rx MA Descriptor */
__align(4)
ETH_DMADESCTypeDef DMATxDscrTab[ETH_TXBUFNB];/* Ethernet Tx DMA Descriptor */
__align(4)
uint8_t Rx_Buff[ETH_RXBUFNB][ETH_RX_BUF_SIZE]; /* Ethernet Receive Buffer */
__align(4)
uint8_t Tx_Buff[ETH_TXBUFNB][ETH_TX_BUF_SIZE]; /* Ethernet Transmit Buffer */

#endif /* __CC_ARM */

/* Global pointers on Tx and Rx descriptor used to track transmit and receive descriptors */
__IO ETH_DMADESCTypeDef *DMATxDescToSet;
__IO ETH_DMADESCTypeDef *DMARxDescToGet;

/* Structure used to hold the last received packet descriptors info */

ETH_DMA_Rx_Frame_infos RX_Frame_Descriptor;
__IO ETH_DMA_Rx_Frame_infos *DMA_RX_FRAME_infos;
__IO uint32_t Frame_Rx_index;

/**
 * @}
 */

/** @defgroup ETH_Private_FunctionPrototypes
 * @{
 */
/**
 * @}
 */

/** @defgroup ETH_Private_Functions
 * @{
 */

#ifndef USE_Delay
/**
 * @brief  Inserts a delay time.
 * @param  nCount: specifies the delay time length.
 * @retval None
 */
static void
ETH_Delay(__IO uint32_t nCount)
{
    __IO uint32_t index = 0;
    for (index = nCount; index != 0; index--)
    {
    }
}
#endif /* USE_Delay*/

/******************************************************************************/
/*                           Global ETH MAC/DMA functions                     */
/******************************************************************************/

/**
 * @brief  Deinitializes the ETHERNET peripheral registers to their default reset values.
 * @param  None
 * @retval None
 */
void
ETH_DeInit(void)
{
    RCC_AHB1PeriphResetCmd(RCC_AHB1Periph_ETH_MAC, ENABLE);
    RCC_AHB1PeriphResetCmd(RCC_AHB1Periph_ETH_MAC, DISABLE);
}

/**
 * @brief  Fills each ETH_InitStruct member with its default value.
 * @param  ETH_InitStruct: pointer to a ETH_InitTypeDef structure which will be initialized.
 * @retval None
 */
void
ETH_StructInit(ETH_InitTypeDef* ETH_InitStruct)
{
    /* ETH_InitStruct members default value */
    /*------------------------   MAC Configuration   ---------------------------*/

    /* PHY Auto-negotiation enabled */
    ETH_InitStruct->ETH_AutoNegotiation = ETH_AutoNegotiation_Enable;
    /* MAC watchdog enabled: cuts-off long frame */
    ETH_InitStruct->ETH_Watchdog = ETH_Watchdog_Enable;
    /* MAC Jabber enabled in Half-duplex mode */
    ETH_InitStruct->ETH_Jabber = ETH_Jabber_Enable;
    /* Ethernet interframe gap set to 96 bits */
    ETH_InitStruct->ETH_InterFrameGap = ETH_InterFrameGap_96Bit;
    /* Carrier Sense Enabled in Half-Duplex mode */
    ETH_InitStruct->ETH_CarrierSense = ETH_CarrierSense_Enable;
    /* PHY speed configured to 100Mbit/s */
    ETH_InitStruct->ETH_Speed = ETH_Speed_100M;
    /* Receive own Frames in Half-Duplex mode enabled */
    ETH_InitStruct->ETH_ReceiveOwn = ETH_ReceiveOwn_Enable;
    /* MAC MII loopback disabled */
    ETH_InitStruct->ETH_LoopbackMode = ETH_LoopbackMode_Disable;
    /* Full-Duplex mode selected */
    ETH_InitStruct->ETH_Mode = ETH_Mode_FullDuplex;
    /* IPv4 and TCP/UDP/ICMP frame Checksum Offload disabled */
    ETH_InitStruct->ETH_ChecksumOffload = ETH_ChecksumOffload_Disable;
    /* Retry Transmission enabled for half-duplex mode */
    ETH_InitStruct->ETH_RetryTransmission = ETH_RetryTransmission_Enable;
    /* Automatic PAD/CRC strip disabled*/
    ETH_InitStruct->ETH_AutomaticPadCRCStrip = ETH_AutomaticPadCRCStrip_Disable;
    /* half-duplex mode retransmission Backoff time_limit = 10 slot times*/
    ETH_InitStruct->ETH_BackOffLimit = ETH_BackOffLimit_10;
    /* half-duplex mode Deferral check disabled */
    ETH_InitStruct->ETH_DeferralCheck = ETH_DeferralCheck_Disable;
    /* Receive all frames disabled */
    ETH_InitStruct->ETH_ReceiveAll = ETH_ReceiveAll_Disable;
    /* Source address filtering (on the optional MAC addresses) disabled */
    ETH_InitStruct->ETH_SourceAddrFilter = ETH_SourceAddrFilter_Disable;
    /* Do not forward control frames that do not pass the address filtering */
    ETH_InitStruct->ETH_PassControlFrames = ETH_PassControlFrames_BlockAll;
    /* Disable reception of Broadcast frames */
    ETH_InitStruct->ETH_BroadcastFramesReception =
            ETH_BroadcastFramesReception_Disable;
    /* Normal Destination address filtering (not reverse addressing) */
    ETH_InitStruct->ETH_DestinationAddrFilter = ETH_DestinationAddrFilter_Normal;
    /* Promiscuous address filtering mode disabled */
    ETH_InitStruct->ETH_PromiscuousMode = ETH_PromiscuousMode_Disable;
    /* Perfect address filtering for multicast addresses */
    ETH_InitStruct->ETH_MulticastFramesFilter =
            ETH_MulticastFramesFilter_Perfect;
    /* Perfect address filtering for unicast addresses */
    ETH_InitStruct->ETH_UnicastFramesFilter = ETH_UnicastFramesFilter_Perfect;
    /* Initialize hash table high and low regs */
    ETH_InitStruct->ETH_HashTableHigh = 0x0;
    ETH_InitStruct->ETH_HashTableLow = 0x0;
    /* Flow control config (flow control disabled)*/
    ETH_InitStruct->ETH_PauseTime = 0x0;
    ETH_InitStruct->ETH_ZeroQuantaPause = ETH_ZeroQuantaPause_Disable;
    ETH_InitStruct->ETH_PauseLowThreshold = ETH_PauseLowThreshold_Minus4;
    ETH_InitStruct->ETH_UnicastPauseFrameDetect =
            ETH_UnicastPauseFrameDetect_Disable;
    ETH_InitStruct->ETH_ReceiveFlowControl = ETH_ReceiveFlowControl_Disable;
    ETH_InitStruct->ETH_TransmitFlowControl = ETH_TransmitFlowControl_Disable;
    /* VLANtag config (VLAN field not checked) */
    ETH_InitStruct->ETH_VLANTagComparison = ETH_VLANTagComparison_16Bit;
    ETH_InitStruct->ETH_VLANTagIdentifier = 0x0;

