OurDreams/mx207/mxapp/bsp/board/mx207/stm32f2xxeth.c
    /*---------------------- DMA Configuration   -------------------------------*/

    /* Drops frames with with TCP/IP checksum errors */
    ETH_InitStruct->ETH_DropTCPIPChecksumErrorFrame =
            ETH_DropTCPIPChecksumErrorFrame_Disable;
    /* Store and forward mode enabled for receive */
    ETH_InitStruct->ETH_ReceiveStoreForward = ETH_ReceiveStoreForward_Enable;
    /* Flush received frame that created FIFO overflow */
    ETH_InitStruct->ETH_FlushReceivedFrame = ETH_FlushReceivedFrame_Enable;
    /* Store and forward mode enabled for transmit */
    ETH_InitStruct->ETH_TransmitStoreForward = ETH_TransmitStoreForward_Enable;
    /* Threshold TXFIFO level set to 64 bytes (used when threshold mode is enabled) */
    ETH_InitStruct->ETH_TransmitThresholdControl =
            ETH_TransmitThresholdControl_64Bytes;
    /* Disable forwarding frames with errors (short frames, CRC,...)*/
    ETH_InitStruct->ETH_ForwardErrorFrames = ETH_ForwardErrorFrames_Disable;
    /* Disable undersized good frames */
    ETH_InitStruct->ETH_ForwardUndersizedGoodFrames =
            ETH_ForwardUndersizedGoodFrames_Disable;
    /* Threshold RXFIFO level set to 64 bytes (used when Cut-through mode is enabled) */
    ETH_InitStruct->ETH_ReceiveThresholdControl =
            ETH_ReceiveThresholdControl_64Bytes;
    /* Disable Operate on second frame (transmit a second frame to FIFO without
     waiting status of previous frame*/
    ETH_InitStruct->ETH_SecondFrameOperate = ETH_SecondFrameOperate_Disable;
    /* DMA works on 32-bit aligned start source and destinations addresses */
    ETH_InitStruct->ETH_AddressAlignedBeats = ETH_AddressAlignedBeats_Enable;
    /* Enabled Fixed Burst Mode (mix of INC4, INC8, INC16 and SINGLE DMA transactions */
    ETH_InitStruct->ETH_FixedBurst = ETH_FixedBurst_Enable;
    /* DMA transfer max burst length = 32 beats = 32 x 32bits */
    ETH_InitStruct->ETH_RxDMABurstLength = ETH_RxDMABurstLength_32Beat;
    ETH_InitStruct->ETH_TxDMABurstLength = ETH_TxDMABurstLength_32Beat;
    /* DMA Ring mode skip length = 0 */
    ETH_InitStruct->ETH_DescriptorSkipLength = 0x0;
    /* Equal priority (round-robin) between transmit and receive DMA engines */
    ETH_InitStruct->ETH_DMAArbitration = ETH_DMAArbitration_RoundRobin_RxTx_1_1;
}

/**
 * @brief  Initializes the ETHERNET peripheral according to the specified
 *   parameters in the ETH_InitStruct .
 * @param ETH_InitStruct: pointer to a ETH_InitTypeDef structure that contains
 *   the configuration information for the specified ETHERNET peripheral.
 * @param PHYAddress: external PHY address
 * @retval ETH_ERROR: Ethernet initialization failed
 *         ETH_SUCCESS: Ethernet successfully initialized
 */
uint32_t
ETH_Init(ETH_InitTypeDef* ETH_InitStruct, uint16_t PHYAddress)
{
    uint32_t RegValue = 0, tmpreg = 0;
    __IO uint32_t i = 0;
    RCC_ClocksTypeDef rcc_clocks;
    uint32_t hclk = 60000000;
    __IO uint32_t timeout = 0;
    /*-------------------------------- MAC Config ------------------------------*/
    /*---------------------- ETHERNET MACMIIAR Configuration -------------------*/
    /* Get the ETHERNET MACMIIAR value */
    tmpreg = ETH->MACMIIAR;
    /* Clear CSR Clock Range CR[2:0] bits */
    tmpreg &= MACMIIAR_CR_MASK;
    /* Get hclk frequency value */
    RCC_GetClocksFreq(&rcc_clocks);
    hclk = rcc_clocks.HCLK_Frequency;
    /* Set CR bits depending on hclk value */
    if ((hclk >= 20000000) && (hclk < 35000000))
    {
        /* CSR Clock Range between 20-35 MHz */
        tmpreg |= (uint32_t) ETH_MACMIIAR_CR_Div16;
    }
    else if ((hclk >= 35000000) && (hclk < 60000000))
    {
        /* CSR Clock Range between 35-60 MHz */
        tmpreg |= (uint32_t) ETH_MACMIIAR_CR_Div26;
    }
    else if ((hclk >= 60000000) && (hclk < 100000000))
    {
        /* CSR Clock Range between 60-100 MHz */
        tmpreg |= (uint32_t) ETH_MACMIIAR_CR_Div42;
    }
    else /* ((hclk >= 100000000)&&(hclk <= 120000000)) */
    {
        /* CSR Clock Range between 100-120 MHz */
        tmpreg |= (uint32_t) ETH_MACMIIAR_CR_Div62;
    }

    /* Write to ETHERNET MAC MIIAR: Configure the ETHERNET CSR Clock Range */ETH->MACMIIAR =
            (uint32_t) tmpreg;
    /*-------------------- PHY initialization and configuration ----------------*/
    /* Put the PHY in reset mode */
    if (!(ETH_WritePHYRegister(PHYAddress, PHY_BCR, PHY_Reset)))
    {
        /* Return ERROR in case of write timeout */
        return ETH_ERROR;
    }


    /* Delay to assure PHY reset */
    //_eth_delay_(PHY_RESET_DELAY);
    /* Delay to assure PHY reset */
    _eth_delay_(PHY_RESET_DELAY);
    if (ETH_InitStruct->ETH_AutoNegotiation != ETH_AutoNegotiation_Disable)
    {
        /* We wait for linked status... */
        do
        {
            timeout++;
        }
        while (!(ETH_ReadPHYRegister(PHYAddress, PHY_BSR) & PHY_Linked_Status)
                && (timeout < PHY_READ_TO));
        /* Return ERROR in case of timeout */
        if (timeout == PHY_READ_TO)
        {
            if (timeout == PHY_READ_TO)
            {
                logmsg("ETH PHY link error\n");
                return ETH_ERROR;
            }
        }
        if ((ETH_ReadPHYRegister(PHYAddress, PHY_BSR) & PHY_Linked_Status))
            logmsg("ETH PHY linked \n");
        else
        {
            logmsg("ETH PHY link error\n");
            return ETH_ERROR;
        }
        /* Reset Timeout counter */
        timeout = 0;
        /* Enable Auto-Negotiation */
        if (!(ETH_WritePHYRegister(PHYAddress, PHY_BCR, PHY_AutoNegotiation)))
        {
            /* Return ERROR in case of write timeout */
            return ETH_ERROR;
        }

        /* Wait until the auto-negotiation will be completed */
        do
        {
            timeout++;
        }
        while (!(ETH_ReadPHYRegister(PHYAddress, PHY_BSR)
                & PHY_AutoNego_Complete) && (timeout < (uint32_t) PHY_READ_TO));

