OurDreams/mx207/mxapp/bsp/board/mx207/stm32f2xxeth.c
    /* Set the DT bit according to ETH_DropTCPIPChecksumErrorFrame value */
    /* Set the RSF bit according to ETH_ReceiveStoreForward value */
    /* Set the DFF bit according to ETH_FlushReceivedFrame value */
    /* Set the TSF bit according to ETH_TransmitStoreForward value */
    /* Set the TTC bit according to ETH_TransmitThresholdControl value */
    /* Set the FEF bit according to ETH_ForwardErrorFrames value */
    /* Set the FUF bit according to ETH_ForwardUndersizedGoodFrames value */
    /* Set the RTC bit according to ETH_ReceiveThresholdControl value */
    /* Set the OSF bit according to ETH_SecondFrameOperate value */
    tmpreg |= (uint32_t) (ETH_InitStruct->ETH_DropTCPIPChecksumErrorFrame
            | ETH_InitStruct->ETH_ReceiveStoreForward
            | ETH_InitStruct->ETH_FlushReceivedFrame
            | ETH_InitStruct->ETH_TransmitStoreForward
            | ETH_InitStruct->ETH_TransmitThresholdControl
            | ETH_InitStruct->ETH_ForwardErrorFrames
            | ETH_InitStruct->ETH_ForwardUndersizedGoodFrames
            | ETH_InitStruct->ETH_ReceiveThresholdControl
            | ETH_InitStruct->ETH_SecondFrameOperate);
    /* Write to ETHERNET DMAOMR */ETH->DMAOMR = (uint32_t) tmpreg;

    /*----------------------- ETHERNET DMABMR Configuration --------------------*/
    /* Set the AAL bit according to ETH_AddressAlignedBeats value */
    /* Set the FB bit according to ETH_FixedBurst value */
    /* Set the RPBL and 4*PBL bits according to ETH_RxDMABurstLength value */
    /* Set the PBL and 4*PBL bits according to ETH_TxDMABurstLength value */
    /* Set the DSL bit according to ETH_DesciptorSkipLength value */
    /* Set the PR and DA bits according to ETH_DMAArbitration value */ETH->DMABMR =
            (uint32_t) (ETH_InitStruct->ETH_AddressAlignedBeats
                    | ETH_InitStruct->ETH_FixedBurst
                    | ETH_InitStruct->ETH_RxDMABurstLength | /* !! if 4xPBL is selected for Tx or Rx it is applied for the other */
                    ETH_InitStruct->ETH_TxDMABurstLength
                    | (ETH_InitStruct->ETH_DescriptorSkipLength << 2)
                    | ETH_InitStruct->ETH_DMAArbitration | ETH_DMABMR_USP); /* Enable use of separate PBL for Rx and Tx */

#ifdef USE_ENHANCED_DMA_DESCRIPTORS
    /* Enable the Enhanced DMA descriptors */ETH->DMABMR |= ETH_DMABMR_EDE;
#endif /* USE_ENHANCED_DMA_DESCRIPTORS */

    /* Return Ethernet configuration success */
    return ETH_SUCCESS;
}

/**
 * @brief  Enables ENET MAC and DMA reception/transmission
 * @param  None
 * @retval None
 */
void
ETH_Start(void)
{
    /* Enable transmit state machine of the MAC for transmission on the MII */
    ETH_MACTransmissionCmd(ENABLE);
    /* Flush Transmit FIFO */
    ETH_FlushTransmitFIFO();
    /* Enable receive state machine of the MAC for reception from the MII */
    ETH_MACReceptionCmd(ENABLE);

    /* Start DMA transmission */
    ETH_DMATransmissionCmd(ENABLE);
    /* Start DMA reception */
    ETH_DMAReceptionCmd(ENABLE);
}

/**
 * @brief  Enables or disables the MAC transmission.
 * @param  NewState: new state of the MAC transmission.
 *   This parameter can be: ENABLE or DISABLE.
 * @retval None
 */
void
ETH_MACTransmissionCmd(FunctionalState NewState)
{

    if (NewState != DISABLE)
    {
        /* Enable the MAC transmission */
        ETH->MACCR |= ETH_MACCR_TE;
    }
    else
    {
        /* Disable the MAC transmission */
        ETH->MACCR &= ~ETH_MACCR_TE;
    }
}

/**
 * @brief  Enables or disables the MAC reception.
 * @param  NewState: new state of the MAC reception.
 *   This parameter can be: ENABLE or DISABLE.
 * @retval None
 */
void
ETH_MACReceptionCmd(FunctionalState NewState)
{

    if (NewState != DISABLE)
    {
        /* Enable the MAC reception */
        ETH->MACCR |= ETH_MACCR_RE;
    }
    else
    {
        /* Disable the MAC reception */
        ETH->MACCR &= ~ETH_MACCR_RE;
    }
}

/**
 * @brief  Checks whether the ETHERNET flow control busy bit is set or not.
 * @param  None
 * @retval The new state of flow control busy status bit (SET or RESET).
 */
FlagStatus
ETH_GetFlowControlBusyStatus(void)
{
    FlagStatus bitstatus = RESET;
    /* The Flow Control register should not be written to until this bit is cleared */
    if ((ETH->MACFCR & ETH_MACFCR_FCBBPA) != (uint32_t) RESET)
    {
        bitstatus = SET;
    }
    else
    {
        bitstatus = RESET;
    }
    return bitstatus;
}

/**
 * @brief  Initiate a Pause Control Frame (Full-duplex only).
 * @param  None
 * @retval None
 */
void
ETH_InitiatePauseControlFrame(void)
{
    /* When Set In full duplex MAC initiates pause control frame */
    ETH->MACFCR |= ETH_MACFCR_FCBBPA;
}

/**
 * @brief  Enables or disables the MAC BackPressure operation activation (Half-duplex only).
 * @param  NewState: new state of the MAC BackPressure operation activation.
 *   This parameter can be: ENABLE or DISABLE.
 * @retval None
 */
void
ETH_BackPressureActivationCmd(FunctionalState NewState)
{

    if (NewState != DISABLE)
    {
        /* Activate the MAC BackPressure operation */
        /* In Half duplex: during backpressure, when the MAC receives a new frame,
         the transmitter starts sending a JAM pattern resulting in a collision */
        ETH->MACFCR |= ETH_MACFCR_FCBBPA;
    }
    else
    {
        /* Desactivate the MAC BackPressure operation */
        ETH->MACFCR &= ~ETH_MACFCR_FCBBPA;
    }
}

/**
 * @brief  Checks whether the specified ETHERNET MAC flag is set or not.
 * @param  ETH_MAC_FLAG: specifies the flag to check.
 *   This parameter can be one of the following values:
 *     @arg ETH_MAC_FLAG_TST  : Time stamp trigger flag
 *     @arg ETH_MAC_FLAG_MMCT : MMC transmit flag
 *     @arg ETH_MAC_FLAG_MMCR : MMC receive flag
 *     @arg ETH_MAC_FLAG_MMC  : MMC flag
 *     @arg ETH_MAC_FLAG_PMT  : PMT flag
 * @retval The new state of ETHERNET MAC flag (SET or RESET).
 */
FlagStatus
ETH_GetMACFlagStatus(uint32_t ETH_MAC_FLAG)
{
    FlagStatus bitstatus = RESET;

