OurDreams/mx207/mxapp/bsp/board/mx207/stm32f2xxeth.c
    if ((ETH->MACSR & ETH_MAC_FLAG) != (uint32_t) RESET)
    {
        bitstatus = SET;
    }
    else
    {
        bitstatus = RESET;
    }
    return bitstatus;
}

/**
 * @brief  Checks whether the specified ETHERNET MAC interrupt has occurred or not.
 * @param  ETH_MAC_IT: specifies the interrupt source to check.
 *   This parameter can be one of the following values:
 *     @arg ETH_MAC_IT_TST   : Time stamp trigger interrupt
 *     @arg ETH_MAC_IT_MMCT : MMC transmit interrupt
 *     @arg ETH_MAC_IT_MMCR : MMC receive interrupt
 *     @arg ETH_MAC_IT_MMC  : MMC interrupt
 *     @arg ETH_MAC_IT_PMT  : PMT interrupt
 * @retval The new state of ETHERNET MAC interrupt (SET or RESET).
 */
ITStatus
ETH_GetMACITStatus(uint32_t ETH_MAC_IT)
{
    ITStatus bitstatus = RESET;

    if ((ETH->MACSR & ETH_MAC_IT) != (uint32_t) RESET)
    {
        bitstatus = SET;
    }
    else
    {
        bitstatus = RESET;
    }
    return bitstatus;
}

/**
 * @brief  Enables or disables the specified ETHERNET MAC interrupts.
 * @param  ETH_MAC_IT: specifies the ETHERNET MAC interrupt sources to be
 *   enabled or disabled.
 *   This parameter can be any combination of the following values:
 *     @arg ETH_MAC_IT_TST : Time stamp trigger interrupt
 *     @arg ETH_MAC_IT_PMT : PMT interrupt
 * @param  NewState: new state of the specified ETHERNET MAC interrupts.
 *   This parameter can be: ENABLE or DISABLE.
 * @retval None
 */
void
ETH_MACITConfig(uint32_t ETH_MAC_IT, FunctionalState NewState)
{

    if (NewState != DISABLE)
    {
        /* Enable the selected ETHERNET MAC interrupts */
        ETH->MACIMR &= (~(uint32_t) ETH_MAC_IT);
    }
    else
    {
        /* Disable the selected ETHERNET MAC interrupts */
        ETH->MACIMR |= ETH_MAC_IT;
    }
}

/**
 * @brief  Configures the selected MAC address.
 * @param  MacAddr: The MAC address to configure.
 *   This parameter can be one of the following values:
 *     @arg ETH_MAC_Address0 : MAC Address0
 *     @arg ETH_MAC_Address1 : MAC Address1
 *     @arg ETH_MAC_Address2 : MAC Address2
 *     @arg ETH_MAC_Address3 : MAC Address3
 * @param  Addr: Pointer on MAC address buffer data (6 bytes).
 * @retval None
 */
void
ETH_MACAddressConfig(uint32_t MacAddr, uint8_t *Addr)
{
    uint32_t tmpreg;

    /* Calculate the selected MAC address high register */
    tmpreg = ((uint32_t) Addr[5] << 8) | (uint32_t) Addr[4];
    /* Load the selected MAC address high register */
    (*(__IO uint32_t *) (ETH_MAC_ADDR_HBASE + MacAddr)) = tmpreg;
    /* Calculate the selected MAC address low register */
    tmpreg = ((uint32_t) Addr[3] << 24) | ((uint32_t) Addr[2] << 16)
            | ((uint32_t) Addr[1] << 8) | Addr[0];

    /* Load the selected MAC address low register */
    (*(__IO uint32_t *) (ETH_MAC_ADDR_LBASE + MacAddr)) = tmpreg;
}

/**
 * @brief  Get the selected MAC address.
 * @param  MacAddr: The MAC address to return.
 *   This parameter can be one of the following values:
 *     @arg ETH_MAC_Address0 : MAC Address0
 *     @arg ETH_MAC_Address1 : MAC Address1
 *     @arg ETH_MAC_Address2 : MAC Address2
 *     @arg ETH_MAC_Address3 : MAC Address3
 * @param  Addr: Pointer on MAC address buffer data (6 bytes).
 * @retval None
 */
void
ETH_GetMACAddress(uint32_t MacAddr, uint8_t *Addr)
{
    uint32_t tmpreg;

    /* Get the selected MAC address high register */
    tmpreg = (*(__IO uint32_t *) (ETH_MAC_ADDR_HBASE + MacAddr));

    /* Calculate the selected MAC address buffer */
    Addr[5] = ((tmpreg >> 8) & (uint8_t) 0xFF);
    Addr[4] = (tmpreg & (uint8_t) 0xFF);
    /* Load the selected MAC address low register */
    tmpreg = (*(__IO uint32_t *) (ETH_MAC_ADDR_LBASE + MacAddr));
    /* Calculate the selected MAC address buffer */
    Addr[3] = ((tmpreg >> 24) & (uint8_t) 0xFF);
    Addr[2] = ((tmpreg >> 16) & (uint8_t) 0xFF);
    Addr[1] = ((tmpreg >> 8) & (uint8_t) 0xFF);
    Addr[0] = (tmpreg & (uint8_t) 0xFF);
}

/**
 * @brief  Enables or disables the Address filter module uses the specified
 *   ETHERNET MAC address for perfect filtering
 * @param  MacAddr: specifies the ETHERNET MAC address to be used for perfect filtering.
 *   This parameter can be one of the following values:
 *     @arg ETH_MAC_Address1 : MAC Address1
 *     @arg ETH_MAC_Address2 : MAC Address2
 *     @arg ETH_MAC_Address3 : MAC Address3
 * @param  NewState: new state of the specified ETHERNET MAC address use.
 *   This parameter can be: ENABLE or DISABLE.
 * @retval None
 */
void
ETH_MACAddressPerfectFilterCmd(uint32_t MacAddr, FunctionalState NewState)
{

    if (NewState != DISABLE)
    {
        /* Enable the selected ETHERNET MAC address for perfect filtering */
        (*(__IO uint32_t *) (ETH_MAC_ADDR_HBASE + MacAddr)) |= ETH_MACA1HR_AE;
    }
    else
    {
        /* Disable the selected ETHERNET MAC address for perfect filtering */
        (*(__IO uint32_t *) (ETH_MAC_ADDR_HBASE + MacAddr)) &=
                (~(uint32_t) ETH_MACA1HR_AE);
    }
}

/**
 * @brief  Set the filter type for the specified ETHERNET MAC address
 * @param  MacAddr: specifies the ETHERNET MAC address
 *   This parameter can be one of the following values:
 *     @arg ETH_MAC_Address1 : MAC Address1
 *     @arg ETH_MAC_Address2 : MAC Address2
 *     @arg ETH_MAC_Address3 : MAC Address3
 * @param  Filter: specifies the used frame received field for comparison
 *   This parameter can be one of the following values:
 *     @arg ETH_MAC_AddressFilter_SA : MAC Address is used to compare with the
 *                                     SA fields of the received frame.
 *     @arg ETH_MAC_AddressFilter_DA : MAC Address is used to compare with the
 *                                     DA fields of the received frame.
 * @retval None
 */
void
ETH_MACAddressFilterConfig(uint32_t MacAddr, uint32_t Filter)
{

    if (Filter != ETH_MAC_AddressFilter_DA)
    {
        /* The selected ETHERNET MAC address is used to compare with the SA fields of the
         received frame. */
        (*(__IO uint32_t *) (ETH_MAC_ADDR_HBASE + MacAddr)) |= ETH_MACA1HR_SA;
    }
    else
    {
        /* The selected ETHERNET MAC address is used to compare with the DA fields of the
         received frame. */
        (*(__IO uint32_t *) (ETH_MAC_ADDR_HBASE + MacAddr)) &=
                (~(uint32_t) ETH_MACA1HR_SA);
    }
}

/**
 * @brief  Set the filter type for the specified ETHERNET MAC address
 * @param  MacAddr: specifies the ETHERNET MAC address
 *   This parameter can be one of the following values:
 *     @arg ETH_MAC_Address1 : MAC Address1
 *     @arg ETH_MAC_Address2 : MAC Address2
 *     @arg ETH_MAC_Address3 : MAC Address3
 * @param  MaskByte: specifies the used address bytes for comparison
 *   This parameter can be any combination of the following values:
 *     @arg ETH_MAC_AddressMask_Byte6 : Mask MAC Address high reg bits [15:8].
 *     @arg ETH_MAC_AddressMask_Byte5 : Mask MAC Address high reg bits [7:0].
 *     @arg ETH_MAC_AddressMask_Byte4 : Mask MAC Address low reg bits [31:24].
 *     @arg ETH_MAC_AddressMask_Byte3 : Mask MAC Address low reg bits [23:16].
 *     @arg ETH_MAC_AddressMask_Byte2 : Mask MAC Address low reg bits [15:8].
 *     @arg ETH_MAC_AddressMask_Byte1 : Mask MAC Address low reg bits [7:0].
 * @retval None
 */
void
ETH_MACAddressMaskBytesFilterConfig(uint32_t MacAddr, uint32_t MaskByte)
{

    /* Clear MBC bits in the selected MAC address  high register */
    (*(__IO uint32_t *) (ETH_MAC_ADDR_HBASE + MacAddr)) &=
            (~(uint32_t) ETH_MACA1HR_MBC);
    /* Set the selected Filter mask bytes */
    (*(__IO uint32_t *) (ETH_MAC_ADDR_HBASE + MacAddr)) |= MaskByte;
}

/******************************************************************************/
/*                           DMA Descriptors functions                        */
/******************************************************************************/

/**
 * @brief  This function should be called to get the received frame (to be used
 * with polling method only).
 * @param  none
 * @retval Structure of type FrameTypeDef
 */
FrameTypeDef
ETH_Get_Received_Frame(void)
{
    uint32_t framelength = 0;
    FrameTypeDef frame =
        { 0, 0, 0 };

    /* Get the Frame Length of the received packet: substruct 4 bytes of the CRC */
    framelength = ((DMARxDescToGet->Status & ETH_DMARxDesc_FL)
            >> ETH_DMARxDesc_FrameLengthShift) - 4;
    frame.length = framelength;

