OurDreams/mx207/mxapp/bsp/board/mx207/stm32f2xxeth.c
    /* Get the address of the buffer start address */
    /* Check if more than one segment in the frame */
    if (DMA_RX_FRAME_infos->Seg_Count > 1)
    {
        frame.buffer = (DMA_RX_FRAME_infos->FS_Rx_Desc)->Buffer1Addr;
    }
    else
    {
        frame.buffer = DMARxDescToGet->Buffer1Addr;
    }

    frame.descriptor = DMARxDescToGet;

    /* Update the ETHERNET DMA global Rx descriptor with next Rx descriptor */
    /* Chained Mode */
    /* Selects the next DMA Rx descriptor list for next buffer to read */
    DMARxDescToGet =
            (ETH_DMADESCTypeDef*) (DMARxDescToGet->Buffer2NextDescAddr);

    /* Return Frame */
    return (frame);
}

/**
 * @brief  This function should be called when a frame is received using DMA
 *         Receive interrupt, it allows scanning of Rx descriptors to get the
 *         the receive frame (should be used with interrupt mode only)
 * @param  None
 * @retval Structure of type FrameTypeDef
 */
FrameTypeDef
ETH_Get_Received_Frame_interrupt(void)
{
    FrameTypeDef frame =
        { 0, 0, 0 };
    __IO uint32_t descriptor_scan_counter = 0;

    /* scan descriptors owned by CPU */
    while (((DMARxDescToGet->Status & ETH_DMARxDesc_OWN) == (uint32_t) RESET)
            && (descriptor_scan_counter < ETH_RXBUFNB))
    {

        /* Just by security */
        descriptor_scan_counter++;

        /* check if first segment in frame */
        if (((DMARxDescToGet->Status & ETH_DMARxDesc_FS) != (uint32_t) RESET)
                && ((DMARxDescToGet->Status & ETH_DMARxDesc_LS)
                        == (uint32_t) RESET))
        {
            DMA_RX_FRAME_infos->FS_Rx_Desc = DMARxDescToGet;
            DMA_RX_FRAME_infos->Seg_Count = 1;
            DMARxDescToGet =
                    (ETH_DMADESCTypeDef*) (DMARxDescToGet->Buffer2NextDescAddr);
        }

        /* check if intermediate segment */
        else if (((DMARxDescToGet->Status & ETH_DMARxDesc_LS)
                == (uint32_t) RESET)
                && ((DMARxDescToGet->Status & ETH_DMARxDesc_FS)
                        == (uint32_t) RESET))
        {
            (DMA_RX_FRAME_infos->Seg_Count)++;
            DMARxDescToGet =
                    (ETH_DMADESCTypeDef*) (DMARxDescToGet->Buffer2NextDescAddr);
        }

        /* should be last segment */
        else
        {
            /* last segment */
            DMA_RX_FRAME_infos->LS_Rx_Desc = DMARxDescToGet;

            (DMA_RX_FRAME_infos->Seg_Count)++;

            /* first segment is last segment */
            if ((DMA_RX_FRAME_infos->Seg_Count) == 1)
                DMA_RX_FRAME_infos->FS_Rx_Desc = DMARxDescToGet;

            /* Get the Frame Length of the received packet: substruct 4 bytes of the CRC */
            frame.length = ((DMARxDescToGet->Status & ETH_DMARxDesc_FL)
                    >> ETH_DMARxDesc_FrameLengthShift) - 4;

            /* Get the address of the buffer start address */
            /* Check if more than one segment in the frame */
            if (DMA_RX_FRAME_infos->Seg_Count > 1)
            {
                frame.buffer = (DMA_RX_FRAME_infos->FS_Rx_Desc)->Buffer1Addr;
            }
            else
            {
                frame.buffer = DMARxDescToGet->Buffer1Addr;
            }

            frame.descriptor = DMARxDescToGet;

            /* Update the ETHERNET DMA global Rx descriptor with next Rx descriptor */
            DMARxDescToGet =
                    (ETH_DMADESCTypeDef*) (DMARxDescToGet->Buffer2NextDescAddr);

            /* Return Frame */
            return (frame);
        }
    }
    return (frame);
}

/**
 * @brief  Prepares DMA Tx descriptors to transmit an ethernet frame
 * @param  FrameLength : length of the frame to send
 * @retval error status
 */
uint32_t
ETH_Prepare_Transmit_Descriptors(u16 FrameLength)
{
    uint32_t buf_count = 0, size = 0, i = 0;
    __IO ETH_DMADESCTypeDef *DMATxNextDesc;

    /* Check if the descriptor is owned by the ETHERNET DMA (when set) or CPU (when reset) */
    if ((DMATxDescToSet->Status & ETH_DMATxDesc_OWN) != (u32) RESET)
    {
        /* Return ERROR: OWN bit set */
        return ETH_ERROR;
    }

    DMATxNextDesc = DMATxDescToSet;

    if (FrameLength > ETH_TX_BUF_SIZE)
    {
        buf_count = FrameLength / ETH_TX_BUF_SIZE;
        if (FrameLength % ETH_TX_BUF_SIZE)
            buf_count++;
    }
    else
        buf_count = 1;

    if (buf_count == 1)
    {
        /*set LAST and FIRST segment */
        DMATxDescToSet->Status |= ETH_DMATxDesc_FS | ETH_DMATxDesc_LS;
        /* Set frame size */
        DMATxDescToSet->ControlBufferSize = (FrameLength & ETH_DMATxDesc_TBS1);
        /* Set Own bit of the Tx descriptor Status: gives the buffer back to ETHERNET DMA */
        DMATxDescToSet->Status |= ETH_DMATxDesc_OWN;
        DMATxDescToSet =
                (ETH_DMADESCTypeDef *) (DMATxDescToSet->Buffer2NextDescAddr);
    }
    else
    {
        for (i = 0; i < buf_count; i++)
        {
            if (i == 0)
            {
                /* Setting the first segment bit */
                DMATxDescToSet->Status |= ETH_DMATxDesc_FS;
            }

            /* Program size */
            DMATxNextDesc->ControlBufferSize = (ETH_TX_BUF_SIZE
                    & ETH_DMATxDesc_TBS1);

            if (i == (buf_count - 1))
            {
                /* Setting the last segment bit */
                DMATxNextDesc->Status |= ETH_DMATxDesc_LS;
                size = FrameLength - (buf_count - 1) * ETH_TX_BUF_SIZE;
                DMATxNextDesc->ControlBufferSize = (size & ETH_DMATxDesc_TBS1);
            }

            /*give back descriptor to DMA */
            DMATxNextDesc->Status |= ETH_DMATxDesc_OWN;

            DMATxNextDesc =
                    (ETH_DMADESCTypeDef *) (DMATxNextDesc->Buffer2NextDescAddr);
            /* Set Own bit of the Tx descriptor Status: gives the buffer back to ETHERNET DMA */
        }
        DMATxDescToSet = DMATxNextDesc;
    }

    /* When Tx Buffer unavailable flag is set: clear it and resume transmission */
    if ((ETH->DMASR & ETH_DMASR_TBUS) != (u32) RESET)
    {
        /* Clear TBUS ETHERNET DMA flag */
        ETH->DMASR = ETH_DMASR_TBUS;
        /* Resume DMA transmission*/
        ETH->DMATPDR = 0;
    }

