OurDreams/mx207/mxapp/bsp/board/mx207/stm32f2xxeth.c
    /* Return SUCCESS */
    return ETH_SUCCESS;
}

/**
 * @brief  Initializes the DMA Rx descriptors in chain mode.
 * @param  DMARxDescTab: Pointer on the first Rx desc list
 * @param  RxBuff: Pointer on the first RxBuffer list
 * @param  RxBuffCount: Number of the used Rx desc in the list
 * @retval None
 */
void
ETH_DMARxDescChainInit(ETH_DMADESCTypeDef *DMARxDescTab, uint8_t *RxBuff,
        uint32_t RxBuffCount)
{
    uint32_t i = 0;
    ETH_DMADESCTypeDef *DMARxDesc;

    /* Set the DMARxDescToGet pointer with the first one of the DMARxDescTab list */
    DMARxDescToGet = DMARxDescTab;
    /* Fill each DMARxDesc descriptor with the right values */
    for (i = 0; i < RxBuffCount; i++)
    {
        /* Get the pointer on the ith member of the Rx Desc list */
        DMARxDesc = DMARxDescTab + i;
        /* Set Own bit of the Rx descriptor Status */
        DMARxDesc->Status = ETH_DMARxDesc_OWN;

        /* Set Buffer1 size and Second Address Chained bit */
        DMARxDesc->ControlBufferSize = ETH_DMARxDesc_RCH
                | (uint32_t) ETH_RX_BUF_SIZE;
        /* Set Buffer1 address pointer */
        DMARxDesc->Buffer1Addr = (uint32_t) (&RxBuff[i * ETH_RX_BUF_SIZE]);

        /* Initialize the next descriptor with the Next Descriptor Polling Enable */
        if (i < (RxBuffCount - 1))
        {
            /* Set next descriptor address register with next descriptor base address */
            DMARxDesc->Buffer2NextDescAddr = (uint32_t) (DMARxDescTab + i + 1);
        }
        else
        {
            /* For last descriptor, set next descriptor address register equal to the first descriptor base address */
            DMARxDesc->Buffer2NextDescAddr = (uint32_t) (DMARxDescTab);
        }
    }

    /* Set Receive Descriptor List Address Register */ETH->DMARDLAR =
            (uint32_t) DMARxDescTab;

    DMA_RX_FRAME_infos = &RX_Frame_Descriptor;

}

/**
 * @brief  This function polls for a frame reception
 * @param  None
 * @retval Returns 1 when a frame is received, 0 if none.
 */
uint32_t
ETH_CheckFrameReceived(void)
{
    /* check if last segment */
    if (((DMARxDescToGet->Status & ETH_DMARxDesc_OWN) == (uint32_t) RESET)
            && ((DMARxDescToGet->Status & ETH_DMARxDesc_LS) != (uint32_t) RESET))
    {
        DMA_RX_FRAME_infos->LS_Rx_Desc = DMARxDescToGet;
        DMA_RX_FRAME_infos->Seg_Count++;
        return 1;
    }

    /* check if first segment */
    else if (((DMARxDescToGet->Status & ETH_DMARxDesc_OWN) == (uint32_t) RESET)
            && ((DMARxDescToGet->Status & ETH_DMARxDesc_FS) != (uint32_t) RESET)
            && ((DMARxDescToGet->Status & ETH_DMARxDesc_LS) == (uint32_t) RESET))
    {
        DMA_RX_FRAME_infos->FS_Rx_Desc = DMARxDescToGet;
        DMA_RX_FRAME_infos->LS_Rx_Desc = NULL;
        DMA_RX_FRAME_infos->Seg_Count = 1;
        DMARxDescToGet =
                (ETH_DMADESCTypeDef*) (DMARxDescToGet->Buffer2NextDescAddr);
    }

    /* check if intermediate segment */
    else if (((DMARxDescToGet->Status & ETH_DMARxDesc_OWN) == (uint32_t) RESET)
            && ((DMARxDescToGet->Status & ETH_DMARxDesc_FS) == (uint32_t) RESET)
            && ((DMARxDescToGet->Status & ETH_DMARxDesc_LS) == (uint32_t) RESET))
    {
        (DMA_RX_FRAME_infos->Seg_Count)++;
        DMARxDescToGet =
                (ETH_DMADESCTypeDef*) (DMARxDescToGet->Buffer2NextDescAddr);
    }
    return 0;
}

/**
 * @brief  Initializes the DMA Tx descriptors in chain mode.
 * @param  DMATxDescTab: Pointer on the first Tx desc list
 * @param  TxBuff: Pointer on the first TxBuffer list
 * @param  TxBuffCount: Number of the used Tx desc in the list
 * @retval None
 */
void
ETH_DMATxDescChainInit(ETH_DMADESCTypeDef *DMATxDescTab, uint8_t* TxBuff,
        uint32_t TxBuffCount)
{
    uint32_t i = 0;
    ETH_DMADESCTypeDef *DMATxDesc;

    /* Set the DMATxDescToSet pointer with the first one of the DMATxDescTab list */
    DMATxDescToSet = DMATxDescTab;
    /* Fill each DMATxDesc descriptor with the right values */
    for (i = 0; i < TxBuffCount; i++)
    {
        /* Get the pointer on the ith member of the Tx Desc list */
        DMATxDesc = DMATxDescTab + i;
        /* Set Second Address Chained bit */
        DMATxDesc->Status = ETH_DMATxDesc_TCH;

        /* Set Buffer1 address pointer */
        DMATxDesc->Buffer1Addr = (uint32_t) (&TxBuff[i * ETH_TX_BUF_SIZE]);

        /* Initialize the next descriptor with the Next Descriptor Polling Enable */
        if (i < (TxBuffCount - 1))
        {
            /* Set next descriptor address register with next descriptor base address */
            DMATxDesc->Buffer2NextDescAddr = (uint32_t) (DMATxDescTab + i + 1);
        }
        else
        {
            /* For last descriptor, set next descriptor address register equal to the first descriptor base address */
            DMATxDesc->Buffer2NextDescAddr = (uint32_t) DMATxDescTab;
        }
    }

    /* Set Transmit Desciptor List Address Register */
    ETH->DMATDLAR = (uint32_t) DMATxDescTab;
}

/**
 * @brief  Checks whether the specified ETHERNET DMA Tx Desc flag is set or not.
 * @param  DMATxDesc: pointer on a DMA Tx descriptor
 * @param  ETH_DMATxDescFlag: specifies the flag to check.
 *   This parameter can be one of the following values:
 *     @arg ETH_DMATxDesc_OWN : OWN bit: descriptor is owned by DMA engine
 *     @arg ETH_DMATxDesc_IC  : Interrupt on completion
 *     @arg ETH_DMATxDesc_LS  : Last Segment
 *     @arg ETH_DMATxDesc_FS  : First Segment
 *     @arg ETH_DMATxDesc_DC  : Disable CRC
 *     @arg ETH_DMATxDesc_DP  : Disable Pad
 *     @arg ETH_DMATxDesc_TTSE: Transmit Time Stamp Enable
 *     @arg ETH_DMATxDesc_CIC : Checksum insertion control
 *     @arg ETH_DMATxDesc_TER : Transmit End of Ring
 *     @arg ETH_DMATxDesc_TCH : Second Address Chained
 *     @arg ETH_DMATxDesc_TTSS: Tx Time Stamp Status
 *     @arg ETH_DMATxDesc_IHE : IP Header Error
 *     @arg ETH_DMATxDesc_ES  : Error summary
 *     @arg ETH_DMATxDesc_JT  : Jabber Timeout
 *     @arg ETH_DMATxDesc_FF  : Frame Flushed: DMA/MTL flushed the frame due to SW flush
 *     @arg ETH_DMATxDesc_PCE : Payload Checksum Error
 *     @arg ETH_DMATxDesc_LCA : Loss of Carrier: carrier lost during transmission
 *     @arg ETH_DMATxDesc_NC  : No Carrier: no carrier signal from the transceiver
 *     @arg ETH_DMATxDesc_LCO : Late Collision: transmission aborted due to collision
 *     @arg ETH_DMATxDesc_EC  : Excessive Collision: transmission aborted after 16 collisions
 *     @arg ETH_DMATxDesc_VF  : VLAN Frame
 *     @arg ETH_DMATxDesc_CC  : Collision Count
 *     @arg ETH_DMATxDesc_ED  : Excessive Deferral
 *     @arg ETH_DMATxDesc_UF  : Underflow Error: late data arrival from the memory
 *     @arg ETH_DMATxDesc_DB  : Deferred Bit
 * @retval The new state of ETH_DMATxDescFlag (SET or RESET).
 */
FlagStatus
ETH_GetDMATxDescFlagStatus(ETH_DMADESCTypeDef *DMATxDesc,
        uint32_t ETH_DMATxDescFlag)
{
    FlagStatus bitstatus = RESET;

    if ((DMATxDesc->Status & ETH_DMATxDescFlag) != (uint32_t) RESET)
    {
        bitstatus = SET;
    }
    else
    {
        bitstatus = RESET;
    }
    return bitstatus;
}

/**
 * @brief  Returns the specified ETHERNET DMA Tx Desc collision count.
 * @param  DMATxDesc: pointer on a DMA Tx descriptor
 * @retval The Transmit descriptor collision counter value.
 */
uint32_t
ETH_GetDMATxDescCollisionCount(ETH_DMADESCTypeDef *DMATxDesc)
{
    /* Return the Receive descriptor frame length */
    return ((DMATxDesc->Status & ETH_DMATxDesc_CC)
            >> ETH_DMATXDESC_COLLISION_COUNTSHIFT);
}

/**
 * @brief  Set the specified DMA Tx Desc Own bit.
 * @param  DMATxDesc: Pointer on a Tx desc
 * @retval None
 */
void
ETH_SetDMATxDescOwnBit(ETH_DMADESCTypeDef *DMATxDesc)
{
    /* Set the DMA Tx Desc Own bit */
    DMATxDesc->Status |= ETH_DMATxDesc_OWN;
}

/**
 * @brief  Enables or disables the specified DMA Tx Desc Transmit interrupt.
 * @param  DMATxDesc: Pointer on a Tx desc
 * @param  NewState: new state of the DMA Tx Desc transmit interrupt.
 *   This parameter can be: ENABLE or DISABLE.
 * @retval None
 */
void
ETH_DMATxDescTransmitITConfig(ETH_DMADESCTypeDef *DMATxDesc,
        FunctionalState NewState)
{

    if (NewState != DISABLE)
    {
        /* Enable the DMA Tx Desc Transmit interrupt */
        DMATxDesc->Status |= ETH_DMATxDesc_IC;
    }
    else
    {
        /* Disable the DMA Tx Desc Transmit interrupt */
        DMATxDesc->Status &= (~(uint32_t) ETH_DMATxDesc_IC);
    }
}

/**
 * @brief  configure Tx descriptor as last or first segment
 * @param  DMATxDesc: Pointer on a Tx desc
 * @param  DMATxDesc_FrameSegment: specifies is the actual Tx desc contain last or first segment.
 *   This parameter can be one of the following values:
 *     @arg ETH_DMATxDesc_LastSegment  : actual Tx desc contain last segment
 *     @arg ETH_DMATxDesc_FirstSegment : actual Tx desc contain first segment
 * @retval None
 */
void
ETH_DMATxDescFrameSegmentConfig(ETH_DMADESCTypeDef *DMATxDesc,
        uint32_t DMATxDesc_FrameSegment)
{

    /* Selects the DMA Tx Desc Frame segment */
    DMATxDesc->Status |= DMATxDesc_FrameSegment;
}

/**
 * @brief  Selects the specified ETHERNET DMA Tx Desc Checksum Insertion.
 * @param  DMATxDesc: pointer on a DMA Tx descriptor
 * @param  DMATxDesc_Checksum: specifies is the DMA Tx desc checksum insertion.
 *   This parameter can be one of the following values:
 *     @arg ETH_DMATxDesc_ChecksumByPass : Checksum bypass
 *     @arg ETH_DMATxDesc_ChecksumIPV4Header : IPv4 header checksum
 *     @arg ETH_DMATxDesc_ChecksumTCPUDPICMPSegment : TCP/UDP/ICMP checksum. Pseudo header checksum is assumed to be present
 *     @arg ETH_DMATxDesc_ChecksumTCPUDPICMPFull : TCP/UDP/ICMP checksum fully in hardware including pseudo header
 * @retval None
 */
void
ETH_DMATxDescChecksumInsertionConfig(ETH_DMADESCTypeDef *DMATxDesc,
        uint32_t DMATxDesc_Checksum)
{

    /* Set the selected DMA Tx desc checksum insertion control */
    DMATxDesc->Status |= DMATxDesc_Checksum;
}

/**
 * @brief  Enables or disables the DMA Tx Desc CRC.
 * @param  DMATxDesc: pointer on a DMA Tx descriptor
 * @param  NewState: new state of the specified DMA Tx Desc CRC.
 *   This parameter can be: ENABLE or DISABLE.
 * @retval None
 */
void
ETH_DMATxDescCRCCmd(ETH_DMADESCTypeDef *DMATxDesc, FunctionalState NewState)
{

    if (NewState != DISABLE)
    {
        /* Enable the selected DMA Tx Desc CRC */
        DMATxDesc->Status &= (~(uint32_t) ETH_DMATxDesc_DC);
    }
    else
    {
        /* Disable the selected DMA Tx Desc CRC */
        DMATxDesc->Status |= ETH_DMATxDesc_DC;
    }
}

/**
 * @brief  Enables or disables the DMA Tx Desc second address chained.
 * @param  DMATxDesc: pointer on a DMA Tx descriptor
 * @param  NewState: new state of the specified DMA Tx Desc second address chained.
 *   This parameter can be: ENABLE or DISABLE.
 * @retval None
 */
void
ETH_DMATxDescSecondAddressChainedCmd(ETH_DMADESCTypeDef *DMATxDesc,
        FunctionalState NewState)
{

    if (NewState != DISABLE)
    {
        /* Enable the selected DMA Tx Desc second address chained */
        DMATxDesc->Status |= ETH_DMATxDesc_TCH;
    }
    else
    {
        /* Disable the selected DMA Tx Desc second address chained */
        DMATxDesc->Status &= (~(uint32_t) ETH_DMATxDesc_TCH);
    }
}

/**
 * @brief  Enables or disables the DMA Tx Desc padding for frame shorter than 64 bytes.
 * @param  DMATxDesc: pointer on a DMA Tx descriptor
 * @param  NewState: new state of the specified DMA Tx Desc padding for frame shorter than 64 bytes.
 *   This parameter can be: ENABLE or DISABLE.
 * @retval None
 */
void
ETH_DMATxDescShortFramePaddingCmd(ETH_DMADESCTypeDef *DMATxDesc,
        FunctionalState NewState)
{

    if (NewState != DISABLE)
    {
        /* Enable the selected DMA Tx Desc padding for frame shorter than 64 bytes */
        DMATxDesc->Status &= (~(uint32_t) ETH_DMATxDesc_DP);
    }
    else
    {
        /* Disable the selected DMA Tx Desc padding for frame shorter than 64 bytes*/
        DMATxDesc->Status |= ETH_DMATxDesc_DP;
    }
}

/**
 * @brief  Configures the specified DMA Tx Desc buffer1 and buffer2 sizes.
 * @param  DMATxDesc: Pointer on a Tx desc
 * @param  BufferSize1: specifies the Tx desc buffer1 size.
 * @param  BufferSize2: specifies the Tx desc buffer2 size (put "0" if not used).
 * @retval None
 */
void
ETH_DMATxDescBufferSizeConfig(ETH_DMADESCTypeDef *DMATxDesc,
        uint32_t BufferSize1, uint32_t BufferSize2)
{

    /* Set the DMA Tx Desc buffer1 and buffer2 sizes values */
    DMATxDesc->ControlBufferSize |= (BufferSize1
            | (BufferSize2 << ETH_DMATXDESC_BUFFER2_SIZESHIFT));
}

/**
 * @brief  Checks whether the specified ETHERNET Rx Desc flag is set or not.
 * @param  DMARxDesc: pointer on a DMA Rx descriptor
 * @param  ETH_DMARxDescFlag: specifies the flag to check.
 *   This parameter can be one of the following values:
 *     @arg ETH_DMARxDesc_OWN:         OWN bit: descriptor is owned by DMA engine
 *     @arg ETH_DMARxDesc_AFM:         DA Filter Fail for the rx frame
 *     @arg ETH_DMARxDesc_ES:          Error summary
 *     @arg ETH_DMARxDesc_DE:          Descriptor error: no more descriptors for receive frame
 *     @arg ETH_DMARxDesc_SAF:         SA Filter Fail for the received frame
 *     @arg ETH_DMARxDesc_LE:          Frame size not matching with length field
 *     @arg ETH_DMARxDesc_OE:          Overflow Error: Frame was damaged due to buffer overflow
 *     @arg ETH_DMARxDesc_VLAN:        VLAN Tag: received frame is a VLAN frame
 *     @arg ETH_DMARxDesc_FS:          First descriptor of the frame
 *     @arg ETH_DMARxDesc_LS:          Last descriptor of the frame
 *     @arg ETH_DMARxDesc_IPV4HCE:     IPC Checksum Error/Giant Frame: Rx Ipv4 header checksum error
 *     @arg ETH_DMARxDesc_LC:          Late collision occurred during reception
 *     @arg ETH_DMARxDesc_FT:          Frame type - Ethernet, otherwise 802.3
 *     @arg ETH_DMARxDesc_RWT:         Receive Watchdog Timeout: watchdog timer expired during reception
 *     @arg ETH_DMARxDesc_RE:          Receive error: error reported by MII interface
 *     @arg ETH_DMARxDesc_DE:          Dribble bit error: frame contains non int multiple of 8 bits
 *     @arg ETH_DMARxDesc_CE:          CRC error
 *     @arg ETH_DMARxDesc_MAMPCE:      Rx MAC Address/Payload Checksum Error: Rx MAC address matched/ Rx Payload Checksum Error
 * @retval The new state of ETH_DMARxDescFlag (SET or RESET).
 */
FlagStatus
ETH_GetDMARxDescFlagStatus(ETH_DMADESCTypeDef *DMARxDesc,
        uint32_t ETH_DMARxDescFlag)
{
    FlagStatus bitstatus = RESET;

    if ((DMARxDesc->Status & ETH_DMARxDescFlag) != (uint32_t) RESET)
    {
        bitstatus = SET;
    }
    else
    {
        bitstatus = RESET;
    }
    return bitstatus;
}

#ifdef USE_ENHANCED_DMA_DESCRIPTORS
/**
 * @brief  Checks whether the specified ETHERNET PTP Rx Desc extended flag is set or not.
 * @param  DMAPTPRxDesc: pointer on a DMA PTP Rx descriptor
 * @param  ETH_DMAPTPRxDescFlag: specifies the extended flag to check.
 *   This parameter can be one of the following values:
 *     @arg ETH_DMAPTPRxDesc_PTPV:   PTP version
 *     @arg ETH_DMAPTPRxDesc_PTPFT:  PTP frame type
 *     @arg ETH_DMAPTPRxDesc_PTPMT:  PTP message type
 *     @arg ETH_DMAPTPRxDesc_IPV6PR: IPv6 packet received
 *     @arg ETH_DMAPTPRxDesc_IPV4PR: IPv4 packet received
 *     @arg ETH_DMAPTPRxDesc_IPCB:   IP checksum bypassed
 *     @arg ETH_DMAPTPRxDesc_IPPE:   IP payload error
 *     @arg ETH_DMAPTPRxDesc_IPHE:   IP header error
 *     @arg ETH_DMAPTPRxDesc_IPPT:   IP payload type
 * @retval The new state of ETH_DMAPTPRxDescExtendedFlag (SET or RESET).
 */
FlagStatus
ETH_GetDMAPTPRxDescExtendedFlagStatus(ETH_DMADESCTypeDef *DMAPTPRxDesc,
        uint32_t ETH_DMAPTPRxDescExtendedFlag)
{
    FlagStatus bitstatus = RESET;

    if ((DMAPTPRxDesc->ExtendedStatus & ETH_DMAPTPRxDescExtendedFlag)
            != (uint32_t) RESET)
    {
        bitstatus = SET;
    }
    else
    {
        bitstatus = RESET;
    }
    return bitstatus;
}
#endif /* USE_ENHANCED_DMA_DESCRIPTORS */

/**
 * @brief  Set the specified DMA Rx Desc Own bit.
 * @param  DMARxDesc: Pointer on a Rx desc
 * @retval None
 */
void
ETH_SetDMARxDescOwnBit(ETH_DMADESCTypeDef *DMARxDesc)
{
    /* Set the DMA Rx Desc Own bit */
    DMARxDesc->Status |= ETH_DMARxDesc_OWN;
}

/**
 * @brief  Returns the specified DMA Rx Desc frame length.
 * @param  DMARxDesc: pointer on a DMA Rx descriptor
 * @retval The Rx descriptor received frame length.
 */
uint32_t
ETH_GetDMARxDescFrameLength(ETH_DMADESCTypeDef *DMARxDesc)
{
    /* Return the Receive descriptor frame length */
    return ((DMARxDesc->Status & ETH_DMARxDesc_FL)
            >> ETH_DMARXDESC_FRAME_LENGTHSHIFT);
}

/**
 * @brief  Enables or disables the specified DMA Rx Desc receive interrupt.
 * @param  DMARxDesc: Pointer on a Rx desc
 * @param  NewState: new state of the specified DMA Rx Desc interrupt.
 *   This parameter can be: ENABLE or DISABLE.
 * @retval None
 */
void
ETH_DMARxDescReceiveITConfig(ETH_DMADESCTypeDef *DMARxDesc,
        FunctionalState NewState)
{

    if (NewState != DISABLE)
    {
        /* Enable the DMA Rx Desc receive interrupt */
        DMARxDesc->ControlBufferSize &= (~(uint32_t) ETH_DMARxDesc_DIC);
    }
    else
    {
        /* Disable the DMA Rx Desc receive interrupt */
        DMARxDesc->ControlBufferSize |= ETH_DMARxDesc_DIC;
    }
}

/**
 * @brief  Returns the specified ETHERNET DMA Rx Desc buffer size.
 * @param  DMARxDesc: pointer on a DMA Rx descriptor
 * @param  DMARxDesc_Buffer: specifies the DMA Rx Desc buffer.
 *   This parameter can be any one of the following values:
 *     @arg ETH_DMARxDesc_Buffer1 : DMA Rx Desc Buffer1
 *     @arg ETH_DMARxDesc_Buffer2 : DMA Rx Desc Buffer2
 * @retval The Receive descriptor frame length.
 */
uint32_t
ETH_GetDMARxDescBufferSize(ETH_DMADESCTypeDef *DMARxDesc,
        uint32_t DMARxDesc_Buffer)
{

