OurDreams/mx207/mxapp/bsp/board/mx207/stm32f2xxeth.c
    if (DMARxDesc_Buffer != ETH_DMARxDesc_Buffer1)
    {
        /* Return the DMA Rx Desc buffer2 size */
        return ((DMARxDesc->ControlBufferSize & ETH_DMARxDesc_RBS2)
                >> ETH_DMARXDESC_BUFFER2_SIZESHIFT);
    }
    else
    {
        /* Return the DMA Rx Desc buffer1 size */
        return (DMARxDesc->ControlBufferSize & ETH_DMARxDesc_RBS1);
    }
}

/**
 * @brief  Get the size of the received packet.
 * @param  None
 * @retval framelength: received packet size
 */
uint32_t
ETH_GetRxPktSize(ETH_DMADESCTypeDef *DMARxDesc)
{
    uint32_t frameLength = 0;
    if (((DMARxDesc->Status & ETH_DMARxDesc_OWN) == (uint32_t) RESET)
            && ((DMARxDesc->Status & ETH_DMARxDesc_ES) == (uint32_t) RESET)
            && ((DMARxDesc->Status & ETH_DMARxDesc_LS) != (uint32_t) RESET))
    {
        /* Get the size of the packet: including 4 bytes of the CRC */
        frameLength = ETH_GetDMARxDescFrameLength(DMARxDesc);
    }

    /* Return Frame Length */
    return frameLength;
}

#ifdef USE_ENHANCED_DMA_DESCRIPTORS
/**
 * @brief  Enables or disables the Enhanced descriptor structure.
 * @param  NewState: new state of the Enhanced descriptor structure.
 *   This parameter can be: ENABLE or DISABLE.
 * @retval None
 */
void
ETH_EnhancedDescriptorCmd(FunctionalState NewState)
{

    if (NewState != DISABLE)
    {
        /* Enable enhanced descriptor structure */
        ETH->DMABMR |= ETH_DMABMR_EDE;
    }
    else
    {
        /* Disable enhanced descriptor structure */
        ETH->DMABMR &= ~ETH_DMABMR_EDE;
    }
}
#endif /* USE_ENHANCED_DMA_DESCRIPTORS */

/******************************************************************************/
/*                           DMA functions                                    */
/******************************************************************************/
/**
 * @brief  Resets all MAC subsystem internal registers and logic.
 * @param  None
 * @retval None
 */
void
ETH_SoftwareReset(void)
{
    /* Set the SWR bit: resets all MAC subsystem internal registers and logic */
    /* After reset all the registers holds their respective reset values */
    ETH->DMABMR |= ETH_DMABMR_SR;
}

/**
 * @brief  Checks whether the ETHERNET software reset bit is set or not.
 * @param  None
 * @retval The new state of DMA Bus Mode register SR bit (SET or RESET).
 */
FlagStatus
ETH_GetSoftwareResetStatus(void)
{
    FlagStatus bitstatus = RESET;
    if ((ETH->DMABMR & ETH_DMABMR_SR) != (uint32_t) RESET)
    {
        bitstatus = SET;
    }
    else
    {
        bitstatus = RESET;
    }
    return bitstatus;
}

/**
 * @brief  Checks whether the specified ETHERNET DMA flag is set or not.
 * @param  ETH_DMA_FLAG: specifies the flag to check.
 *   This parameter can be one of the following values:
 *     @arg ETH_DMA_FLAG_TST : Time-stamp trigger flag
 *     @arg ETH_DMA_FLAG_PMT : PMT flag
 *     @arg ETH_DMA_FLAG_MMC : MMC flag
 *     @arg ETH_DMA_FLAG_DataTransferError : Error bits 0-data buffer, 1-desc. access
 *     @arg ETH_DMA_FLAG_ReadWriteError    : Error bits 0-write trnsf, 1-read transfr
 *     @arg ETH_DMA_FLAG_AccessError       : Error bits 0-Rx DMA, 1-Tx DMA
 *     @arg ETH_DMA_FLAG_NIS : Normal interrupt summary flag
 *     @arg ETH_DMA_FLAG_AIS : Abnormal interrupt summary flag
 *     @arg ETH_DMA_FLAG_ER  : Early receive flag
 *     @arg ETH_DMA_FLAG_FBE : Fatal bus error flag
 *     @arg ETH_DMA_FLAG_ET  : Early transmit flag
 *     @arg ETH_DMA_FLAG_RWT : Receive watchdog timeout flag
 *     @arg ETH_DMA_FLAG_RPS : Receive process stopped flag
 *     @arg ETH_DMA_FLAG_RBU : Receive buffer unavailable flag
 *     @arg ETH_DMA_FLAG_R   : Receive flag
 *     @arg ETH_DMA_FLAG_TU  : Underflow flag
 *     @arg ETH_DMA_FLAG_RO  : Overflow flag
 *     @arg ETH_DMA_FLAG_TJT : Transmit jabber timeout flag
 *     @arg ETH_DMA_FLAG_TBU : Transmit buffer unavailable flag
 *     @arg ETH_DMA_FLAG_TPS : Transmit process stopped flag
 *     @arg ETH_DMA_FLAG_T   : Transmit flag
 * @retval The new state of ETH_DMA_FLAG (SET or RESET).
 */
FlagStatus
ETH_GetDMAFlagStatus(uint32_t ETH_DMA_FLAG)
{
    FlagStatus bitstatus = RESET;

    if ((ETH->DMASR & ETH_DMA_FLAG) != (uint32_t) RESET)
    {
        bitstatus = SET;
    }
    else
    {
        bitstatus = RESET;
    }
    return bitstatus;
}

/**
 * @brief  Clears the ETHERNET抯 DMA pending flag.
 * @param  ETH_DMA_FLAG: specifies the flag to clear.
 *   This parameter can be any combination of the following values:
 *     @arg ETH_DMA_FLAG_NIS : Normal interrupt summary flag
 *     @arg ETH_DMA_FLAG_AIS : Abnormal interrupt summary flag
 *     @arg ETH_DMA_FLAG_ER  : Early receive flag
 *     @arg ETH_DMA_FLAG_FBE : Fatal bus error flag
 *     @arg ETH_DMA_FLAG_ETI : Early transmit flag
 *     @arg ETH_DMA_FLAG_RWT : Receive watchdog timeout flag
 *     @arg ETH_DMA_FLAG_RPS : Receive process stopped flag
 *     @arg ETH_DMA_FLAG_RBU : Receive buffer unavailable flag
 *     @arg ETH_DMA_FLAG_R   : Receive flag
 *     @arg ETH_DMA_FLAG_TU  : Transmit Underflow flag
 *     @arg ETH_DMA_FLAG_RO  : Receive Overflow flag
 *     @arg ETH_DMA_FLAG_TJT : Transmit jabber timeout flag
 *     @arg ETH_DMA_FLAG_TBU : Transmit buffer unavailable flag
 *     @arg ETH_DMA_FLAG_TPS : Transmit process stopped flag
 *     @arg ETH_DMA_FLAG_T   : Transmit flag
 * @retval None
 */
void
ETH_DMAClearFlag(uint32_t ETH_DMA_FLAG)
{

    /* Clear the selected ETHERNET DMA FLAG */
    ETH->DMASR = (uint32_t) ETH_DMA_FLAG;
}

/**
 * @brief  Enables or disables the specified ETHERNET DMA interrupts.
 * @param  ETH_DMA_IT: specifies the ETHERNET DMA interrupt sources to be
 *   enabled or disabled.
 *   This parameter can be any combination of the following values:
 *     @arg ETH_DMA_IT_NIS : Normal interrupt summary
 *     @arg ETH_DMA_IT_AIS : Abnormal interrupt summary
 *     @arg ETH_DMA_IT_ER  : Early receive interrupt
 *     @arg ETH_DMA_IT_FBE : Fatal bus error interrupt
 *     @arg ETH_DMA_IT_ET  : Early transmit interrupt
 *     @arg ETH_DMA_IT_RWT : Receive watchdog timeout interrupt
 *     @arg ETH_DMA_IT_RPS : Receive process stopped interrupt
 *     @arg ETH_DMA_IT_RBU : Receive buffer unavailable interrupt
 *     @arg ETH_DMA_IT_R   : Receive interrupt
 *     @arg ETH_DMA_IT_TU  : Underflow interrupt
 *     @arg ETH_DMA_IT_RO  : Overflow interrupt
 *     @arg ETH_DMA_IT_TJT : Transmit jabber timeout interrupt
 *     @arg ETH_DMA_IT_TBU : Transmit buffer unavailable interrupt
 *     @arg ETH_DMA_IT_TPS : Transmit process stopped interrupt
 *     @arg ETH_DMA_IT_T   : Transmit interrupt
 * @param  NewState: new state of the specified ETHERNET DMA interrupts.
 *   This parameter can be: ENABLE or DISABLE.
 * @retval None
 */
void
ETH_DMAITConfig(uint32_t ETH_DMA_IT, FunctionalState NewState)
{

    if (NewState != DISABLE)
    {
        /* Enable the selected ETHERNET DMA interrupts */
        ETH->DMAIER |= ETH_DMA_IT;
    }
    else
    {
        /* Disable the selected ETHERNET DMA interrupts */
        ETH->DMAIER &= (~(uint32_t) ETH_DMA_IT);
    }
}

/**
 * @brief  Checks whether the specified ETHERNET DMA interrupt has occurred or not.
 * @param  ETH_DMA_IT: specifies the interrupt source to check.
 *   This parameter can be one of the following values:
 *     @arg ETH_DMA_IT_TST : Time-stamp trigger interrupt
 *     @arg ETH_DMA_IT_PMT : PMT interrupt
 *     @arg ETH_DMA_IT_MMC : MMC interrupt
 *     @arg ETH_DMA_IT_NIS : Normal interrupt summary
 *     @arg ETH_DMA_IT_AIS : Abnormal interrupt summary
 *     @arg ETH_DMA_IT_ER  : Early receive interrupt
 *     @arg ETH_DMA_IT_FBE : Fatal bus error interrupt
 *     @arg ETH_DMA_IT_ET  : Early transmit interrupt
 *     @arg ETH_DMA_IT_RWT : Receive watchdog timeout interrupt
 *     @arg ETH_DMA_IT_RPS : Receive process stopped interrupt
 *     @arg ETH_DMA_IT_RBU : Receive buffer unavailable interrupt
 *     @arg ETH_DMA_IT_R   : Receive interrupt
 *     @arg ETH_DMA_IT_TU  : Underflow interrupt
 *     @arg ETH_DMA_IT_RO  : Overflow interrupt
 *     @arg ETH_DMA_IT_TJT : Transmit jabber timeout interrupt
 *     @arg ETH_DMA_IT_TBU : Transmit buffer unavailable interrupt
 *     @arg ETH_DMA_IT_TPS : Transmit process stopped interrupt
 *     @arg ETH_DMA_IT_T   : Transmit interrupt
 * @retval The new state of ETH_DMA_IT (SET or RESET).
 */
ITStatus
ETH_GetDMAITStatus(uint32_t ETH_DMA_IT)
{
    ITStatus bitstatus = RESET;

