OurDreams/mx207/mxapp/bsp/board/mx207/stm32f2xxeth.c
    if ((ETH->DMASR & ETH_DMA_IT) != (uint32_t) RESET)
    {
        bitstatus = SET;
    }
    else
    {
        bitstatus = RESET;
    }
    return bitstatus;
}

/**
 * @brief  Clears the ETHERNET抯 DMA IT pending bit.
 * @param  ETH_DMA_IT: specifies the interrupt pending bit to clear.
 *   This parameter can be any combination of the following values:
 *     @arg ETH_DMA_IT_NIS : Normal interrupt summary
 *     @arg ETH_DMA_IT_AIS : Abnormal interrupt summary
 *     @arg ETH_DMA_IT_ER  : Early receive interrupt
 *     @arg ETH_DMA_IT_FBE : Fatal bus error interrupt
 *     @arg ETH_DMA_IT_ETI : Early transmit interrupt
 *     @arg ETH_DMA_IT_RWT : Receive watchdog timeout interrupt
 *     @arg ETH_DMA_IT_RPS : Receive process stopped interrupt
 *     @arg ETH_DMA_IT_RBU : Receive buffer unavailable interrupt
 *     @arg ETH_DMA_IT_R   : Receive interrupt
 *     @arg ETH_DMA_IT_TU  : Transmit Underflow interrupt
 *     @arg ETH_DMA_IT_RO  : Receive Overflow interrupt
 *     @arg ETH_DMA_IT_TJT : Transmit jabber timeout interrupt
 *     @arg ETH_DMA_IT_TBU : Transmit buffer unavailable interrupt
 *     @arg ETH_DMA_IT_TPS : Transmit process stopped interrupt
 *     @arg ETH_DMA_IT_T   : Transmit interrupt
 * @retval None
 */
void
ETH_DMAClearITPendingBit(uint32_t ETH_DMA_IT)
{

    /* Clear the selected ETHERNET DMA IT */
    ETH->DMASR = (uint32_t) ETH_DMA_IT;
}

/**
 * @brief  Returns the ETHERNET DMA Transmit Process State.
 * @param  None
 * @retval The new ETHERNET DMA Transmit Process State:
 *   This can be one of the following values:
 *     - ETH_DMA_TransmitProcess_Stopped   : Stopped - Reset or Stop Tx Command issued
 *     - ETH_DMA_TransmitProcess_Fetching  : Running - fetching the Tx descriptor
 *     - ETH_DMA_TransmitProcess_Waiting   : Running - waiting for status
 *     - ETH_DMA_TransmitProcess_Reading   : Running - reading the data from host memory
 *     - ETH_DMA_TransmitProcess_Suspended : Suspended - Tx Descriptor unavailable
 *     - ETH_DMA_TransmitProcess_Closing   : Running - closing Rx descriptor
 */
uint32_t
ETH_GetTransmitProcessState(void)
{
    return ((uint32_t) (ETH->DMASR & ETH_DMASR_TS));
}

/**
 * @brief  Returns the ETHERNET DMA Receive Process State.
 * @param  None
 * @retval The new ETHERNET DMA Receive Process State:
 *   This can be one of the following values:
 *     - ETH_DMA_ReceiveProcess_Stopped   : Stopped - Reset or Stop Rx Command issued
 *     - ETH_DMA_ReceiveProcess_Fetching  : Running - fetching the Rx descriptor
 *     - ETH_DMA_ReceiveProcess_Waiting   : Running - waiting for packet
 *     - ETH_DMA_ReceiveProcess_Suspended : Suspended - Rx Descriptor unavailable
 *     - ETH_DMA_ReceiveProcess_Closing   : Running - closing descriptor
 *     - ETH_DMA_ReceiveProcess_Queuing   : Running - queuing the receive frame into host memory
 */
uint32_t
ETH_GetReceiveProcessState(void)
{
    return ((uint32_t) (ETH->DMASR & ETH_DMASR_RS));
}

/**
 * @brief  Clears the ETHERNET transmit FIFO.
 * @param  None
 * @retval None
 */
void
ETH_FlushTransmitFIFO(void)
{
    /* Set the Flush Transmit FIFO bit */
    ETH->DMAOMR |= ETH_DMAOMR_FTF;
}

/**
 * @brief  Checks whether the ETHERNET flush transmit FIFO bit is cleared or not.
 * @param  None
 * @retval The new state of ETHERNET flush transmit FIFO bit (SET or RESET).
 */
FlagStatus
ETH_GetFlushTransmitFIFOStatus(void)
{
    FlagStatus bitstatus = RESET;
    if ((ETH->DMAOMR & ETH_DMAOMR_FTF) != (uint32_t) RESET)
    {
        bitstatus = SET;
    }
    else
    {
        bitstatus = RESET;
    }
    return bitstatus;
}

/**
 * @brief  Enables or disables the DMA transmission.
 * @param  NewState: new state of the DMA transmission.
 *   This parameter can be: ENABLE or DISABLE.
 * @retval None
 */
void
ETH_DMATransmissionCmd(FunctionalState NewState)
{

    if (NewState != DISABLE)
    {
        /* Enable the DMA transmission */
        ETH->DMAOMR |= ETH_DMAOMR_ST;
    }
    else
    {
        /* Disable the DMA transmission */
        ETH->DMAOMR &= ~ETH_DMAOMR_ST;
    }
}

/**
 * @brief  Enables or disables the DMA reception.
 * @param  NewState: new state of the DMA reception.
 *   This parameter can be: ENABLE or DISABLE.
 * @retval None
 */
void
ETH_DMAReceptionCmd(FunctionalState NewState)
{

    if (NewState != DISABLE)
    {
        /* Enable the DMA reception */
        ETH->DMAOMR |= ETH_DMAOMR_SR;
    }
    else
    {
        /* Disable the DMA reception */
        ETH->DMAOMR &= ~ETH_DMAOMR_SR;
    }
}

/**
 * @brief  Checks whether the specified ETHERNET DMA overflow flag is set or not.
 * @param  ETH_DMA_Overflow: specifies the DMA overflow flag to check.
 *   This parameter can be one of the following values:
 *     @arg ETH_DMA_Overflow_RxFIFOCounter : Overflow for FIFO Overflows Counter
 *     @arg ETH_DMA_Overflow_MissedFrameCounter : Overflow for Buffer Unavailable Missed Frame Counter
 * @retval The new state of ETHERNET DMA overflow Flag (SET or RESET).
 */
FlagStatus
ETH_GetDMAOverflowStatus(uint32_t ETH_DMA_Overflow)
{
    FlagStatus bitstatus = RESET;

    if ((ETH->DMAMFBOCR & ETH_DMA_Overflow) != (uint32_t) RESET)
    {
        bitstatus = SET;
    }
    else
    {
        bitstatus = RESET;
    }
    return bitstatus;
}

/**
 * @brief  Get the ETHERNET DMA Rx Overflow Missed Frame Counter value.
 * @param  None
 * @retval The value of Rx overflow Missed Frame Counter.
 */
uint32_t
ETH_GetRxOverflowMissedFrameCounter(void)
{
    return ((uint32_t) ((ETH->DMAMFBOCR & ETH_DMAMFBOCR_MFA)
            >> ETH_DMA_RX_OVERFLOW_MISSEDFRAMES_COUNTERSHIFT));
}

/**
 * @brief  Get the ETHERNET DMA Buffer Unavailable Missed Frame Counter value.
 * @param  None
 * @retval The value of Buffer unavailable Missed Frame Counter.
 */
uint32_t
ETH_GetBufferUnavailableMissedFrameCounter(void)
{
    return ((uint32_t) (ETH->DMAMFBOCR) & ETH_DMAMFBOCR_MFC);
}

/**
 * @brief  Get the ETHERNET DMA DMACHTDR register value.
 * @param  None
 * @retval The value of the current Tx desc start address.
 */
uint32_t
ETH_GetCurrentTxDescStartAddress(void)
{
    return ((uint32_t) (ETH->DMACHTDR));
}

/**
 * @brief  Get the ETHERNET DMA DMACHRDR register value.
 * @param  None
 * @retval The value of the current Rx desc start address.
 */
uint32_t
ETH_GetCurrentRxDescStartAddress(void)
{
    return ((uint32_t) (ETH->DMACHRDR));
}

/**
 * @brief  Get the ETHERNET DMA DMACHTBAR register value.
 * @param  None
 * @retval The value of the current transmit descriptor data buffer address.
 */
uint32_t
ETH_GetCurrentTxBufferAddress(void)
{
    return ((uint32_t) (ETH->DMACHTBAR));
}

/**
 * @brief  Get the ETHERNET DMA DMACHRBAR register value.
 * @param  None
 * @retval The value of the current receive descriptor data buffer address.
 */
uint32_t
ETH_GetCurrentRxBufferAddress(void)
{
    return ((uint32_t) (ETH->DMACHRBAR));
}

/**
 * @brief  Resumes the DMA Transmission by writing to the DmaTxPollDemand register
 *   (the data written could be anything). This forces  the DMA to resume transmission.
 * @param  None
 * @retval None.
 */
void
ETH_ResumeDMATransmission(void)
{
    ETH->DMATPDR = 0;
}

/**
 * @brief  Resumes the DMA Transmission by writing to the DmaRxPollDemand register
 *   (the data written could be anything). This forces the DMA to resume reception.
 * @param  None
 * @retval None.
 */
void
ETH_ResumeDMAReception(void)
{
    ETH->DMARPDR = 0;
}

/**
 * @brief  Set the DMA Receive status watchdog timer register value
 * @param  Value: DMA Receive status watchdog timer register value
 * @retval None
 */
void
ETH_SetReceiveWatchdogTimer(uint8_t Value)
{
    /* Set the DMA Receive status watchdog timer register */
    ETH->DMARSWTR = Value;
}

/******************************************************************************/
/*                                PHY functions                               */
/******************************************************************************/

/**
 * @brief  Read a PHY register
 * @param PHYAddress: PHY device address, is the index of one of supported 32 PHY devices.
 *   This parameter can be one of the following values: 0,..,31
 * @param PHYReg: PHY register address, is the index of one of the 32 PHY register.
 *   This parameter can be one of the following values:
 *     @arg PHY_BCR: Transceiver Basic Control Register
 *     @arg PHY_BSR: Transceiver Basic Status Register
 *     @arg PHY_SR : Transceiver Status Register
 *     @arg More PHY register could be read depending on the used PHY
 * @retval ETH_ERROR: in case of timeout
 *         MAC MIIDR register value: Data read from the selected PHY register (correct read )
 */
uint16_t
ETH_ReadPHYRegister(uint16_t PHYAddress, uint16_t PHYReg)
{
    uint32_t tmpreg = 0;
    __IO uint32_t timeout = 0;

    /* Get the ETHERNET MACMIIAR value */
    tmpreg = ETH->MACMIIAR;
    /* Keep only the CSR Clock Range CR[2:0] bits value */
    tmpreg &= ~MACMIIAR_CR_MASK;
    /* Prepare the MII address register value */
    tmpreg |= (((uint32_t) PHYAddress << 11) & ETH_MACMIIAR_PA); /* Set the PHY device address */
    tmpreg |= (((uint32_t) PHYReg << 6) & ETH_MACMIIAR_MR); /* Set the PHY register address */
    tmpreg &= ~ETH_MACMIIAR_MW; /* Set the read mode */
    tmpreg |= ETH_MACMIIAR_MB; /* Set the MII Busy bit */
    /* Write the result value into the MII Address register */ETH->MACMIIAR =
            tmpreg;
    /* Check for the Busy flag */
    do
    {
        timeout++;
        tmpreg = ETH->MACMIIAR;
    }
    while ((tmpreg & ETH_MACMIIAR_MB) && (timeout < (uint32_t) PHY_READ_TO));
    /* Return ERROR in case of timeout */
    if (timeout == PHY_READ_TO)
    {

        return (uint16_t) ETH_ERROR;
    }
    /* Return data register value */
    return (uint16_t) (ETH->MACMIIDR);
}

/**
 * @brief  Write to a PHY register
 * @param PHYAddress: PHY device address, is the index of one of supported 32 PHY devices.
 *   This parameter can be one of the following values: 0,..,31
 * @param PHYReg: PHY register address, is the index of one of the 32 PHY register.
 *   This parameter can be one of the following values:
 *     @arg PHY_BCR    : Transceiver Control Register
 *     @arg More PHY register could be written depending on the used PHY
 * @param  PHYValue: the value to write
 * @retval ETH_ERROR: in case of timeout
 *         ETH_SUCCESS: for correct write
 */
uint32_t
ETH_WritePHYRegister(uint16_t PHYAddress, uint16_t PHYReg, uint16_t PHYValue)
{
    uint32_t tmpreg = 0;
    __IO uint32_t timeout = 0;

    /* Get the ETHERNET MACMIIAR value */
    tmpreg = ETH->MACMIIAR;
    /* Keep only the CSR Clock Range CR[2:0] bits value */
    tmpreg &= ~MACMIIAR_CR_MASK;
    /* Prepare the MII register address value */
    tmpreg |= (((uint32_t) PHYAddress << 11) & ETH_MACMIIAR_PA); /* Set the PHY device address */
    tmpreg |= (((uint32_t) PHYReg << 6) & ETH_MACMIIAR_MR); /* Set the PHY register address */
    tmpreg |= ETH_MACMIIAR_MW; /* Set the write mode */
    tmpreg |= ETH_MACMIIAR_MB; /* Set the MII Busy bit */
    /* Give the value to the MII data register */ETH->MACMIIDR = PHYValue;
    /* Write the result value into the MII Address register */ETH->MACMIIAR =
            tmpreg;
    /* Check for the Busy flag */
    do
    {
        timeout++;
        tmpreg = ETH->MACMIIAR;
    }
    while ((tmpreg & ETH_MACMIIAR_MB) && (timeout < (uint32_t) PHY_WRITE_TO));

