OurDreams/mx207/mxapp/bsp/board/mx207/stm32f2xxeth.c
    /* Return ERROR in case of timeout */
    if (timeout == PHY_WRITE_TO)
    {

        return ETH_ERROR;
    }
    /* Return SUCCESS */
    return ETH_SUCCESS;
}

/**
 * @brief  Enables or disables the PHY loopBack mode.
 * @Note: Don't be confused with ETH_MACLoopBackCmd function which enables internal
 *  loopback at MII level
 * @param  PHYAddress: PHY device address, is the index of one of supported 32 PHY devices.
 * @param  NewState: new state of the PHY loopBack mode.
 *   This parameter can be: ENABLE or DISABLE.
 * @retval ETH_ERROR: in case of bad PHY configuration
 *         ETH_SUCCESS: for correct PHY configuration
 */
uint32_t
ETH_PHYLoopBackCmd(uint16_t PHYAddress, FunctionalState NewState)
{
    uint16_t tmpreg = 0;

    /* Get the PHY configuration to update it */
    tmpreg = ETH_ReadPHYRegister(PHYAddress, PHY_BCR);

    if (NewState != DISABLE)
    {
        /* Enable the PHY loopback mode */
        tmpreg |= PHY_Loopback;
    }
    else
    {
        /* Disable the PHY loopback mode: normal mode */
        tmpreg &= (uint16_t) (~(uint16_t) PHY_Loopback);
    }
    /* Update the PHY control register with the new configuration */
    if (ETH_WritePHYRegister(PHYAddress, PHY_BCR, tmpreg) != (uint32_t) RESET)
    {
        return ETH_SUCCESS;
    }
    else
    {
        /* Return SUCCESS */
        return ETH_ERROR;
    }
}

/******************************************************************************/
/*                           Power Management(PMT) functions                  */
/******************************************************************************/
/**
 * @brief  Reset Wakeup frame filter register pointer.
 * @param  None
 * @retval None
 */
void
ETH_ResetWakeUpFrameFilterRegisterPointer(void)
{
    /* Resets the Remote Wake-up Frame Filter register pointer to 0x0000 */
    ETH->MACPMTCSR |= ETH_MACPMTCSR_WFFRPR;
}

/**
 * @brief  Populates the remote wakeup frame registers.
 * @param  Buffer: Pointer on remote WakeUp Frame Filter Register buffer data (8 words).
 * @retval None
 */
void
ETH_SetWakeUpFrameFilterRegister(uint32_t *Buffer)
{
    uint32_t i = 0;

    /* Fill Remote Wake-up Frame Filter register with Buffer data */
    for (i = 0; i < ETH_WAKEUP_REGISTER_LENGTH; i++)
    {
        /* Write each time to the same register */
        ETH->MACRWUFFR = Buffer[i];
    }
}

/**
 * @brief  Enables or disables any unicast packet filtered by the MAC address
 *   recognition to be a wake-up frame.
 * @param  NewState: new state of the MAC Global Unicast Wake-Up.
 *   This parameter can be: ENABLE or DISABLE.
 * @retval None
 */
void
ETH_GlobalUnicastWakeUpCmd(FunctionalState NewState)
{

    if (NewState != DISABLE)
    {
        /* Enable the MAC Global Unicast Wake-Up */
        ETH->MACPMTCSR |= ETH_MACPMTCSR_GU;
    }
    else
    {
        /* Disable the MAC Global Unicast Wake-Up */
        ETH->MACPMTCSR &= ~ETH_MACPMTCSR_GU;
    }
}

/**
 * @brief  Checks whether the specified ETHERNET PMT flag is set or not.
 * @param  ETH_PMT_FLAG: specifies the flag to check.
 *   This parameter can be one of the following values:
 *     @arg ETH_PMT_FLAG_WUFFRPR : Wake-Up Frame Filter Register Pointer Reset
 *     @arg ETH_PMT_FLAG_WUFR    : Wake-Up Frame Received
 *     @arg ETH_PMT_FLAG_MPR     : Magic Packet Received
 * @retval The new state of ETHERNET PMT Flag (SET or RESET).
 */
FlagStatus
ETH_GetPMTFlagStatus(uint32_t ETH_PMT_FLAG)
{
    FlagStatus bitstatus = RESET;

    if ((ETH->MACPMTCSR & ETH_PMT_FLAG) != (uint32_t) RESET)
    {
        bitstatus = SET;
    }
    else
    {
        bitstatus = RESET;
    }
    return bitstatus;
}

/**
 * @brief  Enables or disables the MAC Wake-Up Frame Detection.
 * @param  NewState: new state of the MAC Wake-Up Frame Detection.
 *   This parameter can be: ENABLE or DISABLE.
 * @retval None
 */
void
ETH_WakeUpFrameDetectionCmd(FunctionalState NewState)
{

    if (NewState != DISABLE)
    {
        /* Enable the MAC Wake-Up Frame Detection */
        ETH->MACPMTCSR |= ETH_MACPMTCSR_WFE;
    }
    else
    {
        /* Disable the MAC Wake-Up Frame Detection */
        ETH->MACPMTCSR &= ~ETH_MACPMTCSR_WFE;
    }
}

/**
 * @brief  Enables or disables the MAC Magic Packet Detection.
 * @param  NewState: new state of the MAC Magic Packet Detection.
 *   This parameter can be: ENABLE or DISABLE.
 * @retval None
 */
void
ETH_MagicPacketDetectionCmd(FunctionalState NewState)
{

    if (NewState != DISABLE)
    {
        /* Enable the MAC Magic Packet Detection */
        ETH->MACPMTCSR |= ETH_MACPMTCSR_MPE;
    }
    else
    {
        /* Disable the MAC Magic Packet Detection */
        ETH->MACPMTCSR &= ~ETH_MACPMTCSR_MPE;
    }
}

/**
 * @brief  Enables or disables the MAC Power Down.
 * @param  NewState: new state of the MAC Power Down.
 *   This parameter can be: ENABLE or DISABLE.
 * @retval None
 */
void
ETH_PowerDownCmd(FunctionalState NewState)
{

    if (NewState != DISABLE)
    {
        /* Enable the MAC Power Down */
        /* This puts the MAC in power down mode */
        ETH->MACPMTCSR |= ETH_MACPMTCSR_PD;
    }
    else
    {
        /* Disable the MAC Power Down */
        ETH->MACPMTCSR &= ~ETH_MACPMTCSR_PD;
    }
}

/******************************************************************************/
/*                              MMC functions                                 */
/******************************************************************************/
/**
 * @brief  Preset and Initialize the MMC counters to almost-full value: 0xFFFF_FFF0 (full - 16)
 * @param  None
 * @retval None
 */
void
ETH_MMCCounterFullPreset(void)
{
    /* Preset and Initialize the MMC counters to almost-full value */
    ETH->MMCCR |= ETH_MMCCR_MCFHP | ETH_MMCCR_MCP;
}

/**
 * @brief  Preset and Initialize the MMC counters to almost-hal value: 0x7FFF_FFF0 (half - 16).
 * @param  None
 * @retval None
 */
void
ETH_MMCCounterHalfPreset(void)
{
    /* Preset the MMC counters to almost-full value */
    ETH->MMCCR &= ~ETH_MMCCR_MCFHP;
    /* Initialize the MMC counters to almost-half value */
    ETH->MMCCR |= ETH_MMCCR_MCP;
}

/**
 * @brief  Enables or disables the MMC Counter Freeze.
 * @param  NewState: new state of the MMC Counter Freeze.
 *   This parameter can be: ENABLE or DISABLE.
 * @retval None
 */
void
ETH_MMCCounterFreezeCmd(FunctionalState NewState)
{

    if (NewState != DISABLE)
    {
        /* Enable the MMC Counter Freeze */
        ETH->MMCCR |= ETH_MMCCR_MCF;
    }
    else
    {
        /* Disable the MMC Counter Freeze */
        ETH->MMCCR &= ~ETH_MMCCR_MCF;
    }
}

/**
 * @brief  Enables or disables the MMC Reset On Read.
 * @param  NewState: new state of the MMC Reset On Read.
 *   This parameter can be: ENABLE or DISABLE.
 * @retval None
 */
void
ETH_MMCResetOnReadCmd(FunctionalState NewState)
{

    if (NewState != DISABLE)
    {
        /* Enable the MMC Counter reset on read */
        ETH->MMCCR |= ETH_MMCCR_ROR;
    }
    else
    {
        /* Disable the MMC Counter reset on read */
        ETH->MMCCR &= ~ETH_MMCCR_ROR;
    }
}

/**
 * @brief  Enables or disables the MMC Counter Stop Rollover.
 * @param  NewState: new state of the MMC Counter Stop Rollover.
 *   This parameter can be: ENABLE or DISABLE.
 * @retval None
 */
void
ETH_MMCCounterRolloverCmd(FunctionalState NewState)
{

    if (NewState != DISABLE)
    {
        /* Disable the MMC Counter Stop Rollover  */
        ETH->MMCCR &= ~ETH_MMCCR_CSR;
    }
    else
    {
        /* Enable the MMC Counter Stop Rollover */
        ETH->MMCCR |= ETH_MMCCR_CSR;
    }
}

/**
 * @brief  Resets the MMC Counters.
 * @param  None
 * @retval None
 */
void
ETH_MMCCountersReset(void)
{
    /* Resets the MMC Counters */
    ETH->MMCCR |= ETH_MMCCR_CR;
}

/**
 * @brief  Enables or disables the specified ETHERNET MMC interrupts.
 * @param  ETH_MMC_IT: specifies the ETHERNET MMC interrupt sources to be enabled or disabled.
 *   This parameter can be any combination of Tx interrupt or
 *   any combination of Rx interrupt (but not both)of the following values:
 *     @arg ETH_MMC_IT_TGF   : When Tx good frame counter reaches half the maximum value
 *     @arg ETH_MMC_IT_TGFMSC: When Tx good multi col counter reaches half the maximum value
 *     @arg ETH_MMC_IT_TGFSC : When Tx good single col counter reaches half the maximum value
 *     @arg ETH_MMC_IT_RGUF  : When Rx good unicast frames counter reaches half the maximum value
 *     @arg ETH_MMC_IT_RFAE  : When Rx alignment error counter reaches half the maximum value
 *     @arg ETH_MMC_IT_RFCE  : When Rx crc error counter reaches half the maximum value
 * @param  NewState: new state of the specified ETHERNET MMC interrupts.
 *   This parameter can be: ENABLE or DISABLE.
 * @retval None
 */
void
ETH_MMCITConfig(uint32_t ETH_MMC_IT, FunctionalState NewState)
{

    if ((ETH_MMC_IT & (uint32_t) 0x10000000) != (uint32_t) RESET)
    {
        /* Remove Register mak from IT */
        ETH_MMC_IT &= 0xEFFFFFFF;

        /* ETHERNET MMC Rx interrupts selected */
        if (NewState != DISABLE)
        {
            /* Enable the selected ETHERNET MMC interrupts */
            ETH->MMCRIMR &= (~(uint32_t) ETH_MMC_IT);
        }
        else
        {
            /* Disable the selected ETHERNET MMC interrupts */
            ETH->MMCRIMR |= ETH_MMC_IT;
        }
    }
    else
    {
        /* ETHERNET MMC Tx interrupts selected */
        if (NewState != DISABLE)
        {
            /* Enable the selected ETHERNET MMC interrupts */
            ETH->MMCTIMR &= (~(uint32_t) ETH_MMC_IT);
        }
        else
        {
            /* Disable the selected ETHERNET MMC interrupts */
            ETH->MMCTIMR |= ETH_MMC_IT;
        }
    }
}

/**
 * @brief  Checks whether the specified ETHERNET MMC IT is set or not.
 * @param  ETH_MMC_IT: specifies the ETHERNET MMC interrupt.
 *   This parameter can be one of the following values:
 *     @arg ETH_MMC_IT_TxFCGC: When Tx good frame counter reaches half the maximum value
 *     @arg ETH_MMC_IT_TxMCGC: When Tx good multi col counter reaches half the maximum value
 *     @arg ETH_MMC_IT_TxSCGC: When Tx good single col counter reaches half the maximum value
 *     @arg ETH_MMC_IT_RxUGFC: When Rx good unicast frames counter reaches half the maximum value
 *     @arg ETH_MMC_IT_RxAEC : When Rx alignment error counter reaches half the maximum value
 *     @arg ETH_MMC_IT_RxCEC : When Rx crc error counter reaches half the maximum value
 * @retval The value of ETHERNET MMC IT (SET or RESET).
 */
ITStatus
ETH_GetMMCITStatus(uint32_t ETH_MMC_IT)
{
    ITStatus bitstatus = RESET;

    if ((ETH_MMC_IT & (uint32_t) 0x10000000) != (uint32_t) RESET)
    {
        /* ETHERNET MMC Rx interrupts selected */
        /* Check if the ETHERNET MMC Rx selected interrupt is enabled and occurred */
        if ((((ETH->MMCRIR & ETH_MMC_IT) != (uint32_t) RESET))
                && ((ETH->MMCRIMR & ETH_MMC_IT) == (uint32_t) RESET))
        {
            bitstatus = SET;
        }
        else
        {
            bitstatus = RESET;
        }
    }
    else
    {
        /* ETHERNET MMC Tx interrupts selected */
        /* Check if the ETHERNET MMC Tx selected interrupt is enabled and occurred */
        if ((((ETH->MMCTIR & ETH_MMC_IT) != (uint32_t) RESET))
                && ((ETH->MMCRIMR & ETH_MMC_IT) == (uint32_t) RESET))
        {
            bitstatus = SET;
        }
        else
        {
            bitstatus = RESET;
        }
    }

