OurDreams/mx207/mxapp/bsp/board/mx207/stm32f2xxeth.c
    return bitstatus;
}

/**
 * @brief  Get the specified ETHERNET MMC register value.
 * @param  ETH_MMCReg: specifies the ETHERNET MMC register.
 *   This parameter can be one of the following values:
 *     @arg ETH_MMCCR      : MMC CR register
 *     @arg ETH_MMCRIR     : MMC RIR register
 *     @arg ETH_MMCTIR     : MMC TIR register
 *     @arg ETH_MMCRIMR    : MMC RIMR register
 *     @arg ETH_MMCTIMR    : MMC TIMR register
 *     @arg ETH_MMCTGFSCCR : MMC TGFSCCR register
 *     @arg ETH_MMCTGFMSCCR: MMC TGFMSCCR register
 *     @arg ETH_MMCTGFCR   : MMC TGFCR register
 *     @arg ETH_MMCRFCECR  : MMC RFCECR register
 *     @arg ETH_MMCRFAECR  : MMC RFAECR register
 *     @arg ETH_MMCRGUFCR  : MMC RGUFCRregister
 * @retval The value of ETHERNET MMC Register value.
 */
uint32_t
ETH_GetMMCRegister(uint32_t ETH_MMCReg)
{

    /* Return the selected register value */
    return (*(__IO uint32_t *) (ETH_MAC_BASE + ETH_MMCReg));
}

#if 0
uint32
do_phyr(cmd_tbl_t * cmdtp, uint32 argc, uint8 *argv[])
{
    uint32 reg;
    uint32 value;
    // 参数数量=1
    if ((argc != 2))
    {
        logmsg("Usage:\r\n");
        logmsg("%s\r\n", cmdtp->usage);
        return 1;
    }
    if (0 == sscanf((int8 *) argv[1], "%i", &reg))
    {
        logmsg("Usage:\r\n");
        logmsg("%s\r\n", cmdtp->usage);
        return 1;
    }

    value = ETH_ReadPHYRegister(0, reg);
    logmsg("phy reg:%d  value:%x\n", reg, value);
    return 0;
}

SHELL_CMD( phyr, CFG_MAXARGS, do_phyr, "v \r\t\t\t\t Read phy reg\r\n"

);
#endif
/**
 * @}
 */

/**
 * @}
 */
